{"id":1520,"date":"2017-08-15T22:29:50","date_gmt":"2017-08-15T22:29:50","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1347"},"modified":"2021-04-09T17:45:02","modified_gmt":"2021-04-09T17:45:02","slug":"popular-online-scams-2017-avoid","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/","title":{"rendered":"Popular Online Scams of 2017 and How to Avoid Them"},"content":{"rendered":"<p>It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they&#8217;re not careful these days. Everything from pop ups to emails can be potential threats, but gone are the days of obvious attacks. These days scams are a lot more subtle and more believable and so it&#8217;s important to be wary of the latest and most popular scams as well as how to avoid them.<\/p>\n<p><span style=\"font-weight: 400;\">The following list is based on statistics from <\/span><a href=\"https:\/\/www.scamwatch.gov.au\/about-scamwatch\/scam-statistics\"><span style=\"font-weight: 400;\">scamwatch.gov.au<\/span><\/a><span style=\"font-weight: 400;\"> and is ordered according to how much money they have cost their victims. Here are the 5 most popular scams of 2017 so far:<\/span><\/p>\n<ol>\n<li><b> Investment Schemes<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Investment schemes is a broad heading to describe internet scams where the target is enticed to hand over money with false promises of making a return on their investment. The most popular investment schemes are forex trading, Ponzi schemes, and offshore investment schemes. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Forex trading is a means of buying different currencies and selling them once the exchange rate has increased. Forex trading is very risky because it  is usually done by big international banks with large accounts, specially trained staff and advanced technology that can handle the complexities of the trading.. The likelihood that an individual working independently can compete with the resources of these banks is very slim, which is why Forex trading so often leads to failed investments. In addition to the stiff competition, a lot of times the companies online that promise great success in forex trading are actually fraudulent and won&#8217;t actually invest your money in anything, resulting in you losing a lot of money.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A Ponzi scheme, also known as a pyramid scheme, is disguised as an opportunity to earn money from an investment when in actuality there really isn&#8217;t any investment. What the promoters of these schemes do is they get you to invest money with promises of making a big return, however, you must invite\/recruit others into the program in order to get any payoff. Eventually, though, people stop joining the group and the benefits that the first few investors used to receive begin to diminish because the &#8216;investment checks&#8217; that they were receiving were actually coming from their investments and the money that their recruits added into the scheme. Due to this flawed system, Ponzi schemes always collapse when the money owed to previous investors becomes greater than the money being raised from the new ones.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Offshore investment schemes, are schemess that encourage you to transfer your money to an account in another country in order to avoid or pay fewer taxes. This is a big red flag when investing your money because if you get caught you could end up owing your government in back taxes, penalties, and interest. You should stay clear of any opportunity that lists avoiding tax paying as an advantage.<\/span><\/p>\n<ol start=\"2\">\n<li><b> Dating and Romance Scams<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Not only are our identities and money at risk, but with dating and romance scams lurking around every other web page now our emotions are also at risk as well. Many times people will make false profiles on dating sites in order to scam people out of money.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">What the scammers do is play on your emotions by using the information you post on your profile in order to make it appear as if you share the same interests, then they build a relationship with you until they begin to manipulate you and trick you into giving them money. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The FBI has a great video, which explains how dating and romance scams work, which you can view below:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Where is the video?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another form of romance scams that occur online is &#8216;Catfishing.&#8217; This kind of scam usually doesn&#8217;t involve any loss of money but results in other kinds of loss such as loss of time, distress, and disappointment. A &#8216;catfish&#8217; is when you&#8217;ve been speaking to someone online and they turn out to be a different person from whom they claimed to be online.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A great way spot romance scams are by performing a Google image search of the profile picture that the person is using and see if the picture come up with a different name. This is an obvious red flag that the person you are talking to isn&#8217;t who they say they are.<\/span><\/p>\n<ol start=\"3\">\n<li><b> Up-Front Payment and Advanced Fees Fraud<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Up-front payment and advanced fees fraud refers to any scam that requires you to pay a fee up front in order to receive a &#8216;reward&#8217; later. ScamAlert lists reclaim scams, unexpected prize scams, travel prize scams, and rental scams as common examples of upfront payment and advanced fees fraud.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Reclaim scams happen when a scammer tells you that qualify for a rebate\/reimbursement, but in order to receive it you must pay a fee This is the same thing that happens with the unexpected prize scam: You are told that you are a winner of a grand prize but that you need to pay processing fees before you can get it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The travel prize scam, on the other hand, is when you are presented with a free or discounted trip on one condition, you must first buy &#8216;travel vouchers&#8217; before you can book your holiday. The rental scam is similar to the travel prize scam, usually you are offered a discounted price on a room with a catch of having to pay a booking fee upfront. Both scams take your money without delivering the promised product or service. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The best way to protect yourself from such scams is to always be cautious of up front fees.  If you are ever asked to pay up front under the guise of shipping costs, taxes, administration fees, or postage, then you should immediately become suspicious. If you truly did win something for free then most of the time such fees would have already been covered. There are cases, however when companies offer products for free and only require you to pay for shipping. Just be sure to contact the company using a number that you have found either in the phone book or by performing an online search. Never use the contact details that they provide.<\/span><\/p>\n<ol start=\"4\">\n<li><b>Buying and Selling Scams<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">According to ScamWatch, buying and selling scams include classified scams, overpayment scams, online shopping scams, and false billing. A total of 4.4 million dollars has already been lost due to buying and selling scams since the start of the year, with 14.5% of cases occurring on the Internet.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With these kinds of scams, scammers pretend to be an online seller, overpay you on an item you&#8217;re selling online, and send fake bills of &#8216;overdue&#8217; payments. The ones that pose as a seller is simply copying the details of an already existing legitimate ad, including the pictures of the product. In order to lure you in, they will advertise the product at a much lower price than the competitors. Unfortunately, however, they often make up a story about being overseas and needing to use an agent to send you the item once you pay for it. As soon as you send the payment,they will flee with your money, leaving you with a fake receipt of payment via email.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To avoid selling scams it is advised that you only buy from reputable sites online, and if buying from eBay you should always check the reviews of the seller before making a purchase.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">How the overpayment scam works is a scammer will send you more money than you&#8217;re asking for on something you&#8217;re selling online and then ask for a &#8216;refund,&#8217; claiming that they sent the extra money to cover extra shipping costs or some excuse. The catch to this scam is that you are asked to &#8216;refund&#8217; the money by sending a wire transfer, using a prepaid card or an online bank transfer and after you send the money their check bounces.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To avoid overpayment scams be sure to wait on the person&#8217;s check to clear before you return any money to them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The final kind of scam in this category is the false billing scam. This occurs when a scammer sends you or your company a bill\/invoice for an advertising listing, domain renewal or directory listing. Often times these claims are false and the scammers put emphasis on paying the amount due as quickly as possible. Sometimes they even threaten &#8216;legal&#8217; action if you don&#8217;t pay the invoice in a timely manner. The best thing to do in a situation like this is to check with your employer to confirm that the invoice is actually real, or to speak to a lawyer about the validity of the invoice.<\/span><\/p>\n<ol start=\"5\">\n<li><b> Inheritance Scams<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">An inheritance scam begins when you are contacted by someone posing as a lawyer or banker claiming that an unrelated wealthy person with your last name has died leaving a large fortune and no will behind. The fake lawyer\/banker will then tell you that you can claim the money left behind because of a legal loophole due to you both having the same last name.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Often times these wealthy persons live in another country and because of this, once again, you will have to pay processing fees in order for the bank to release the funds to you. However, the inheritance scam can be very convincing because the scammers go as far as to provide fake birth certificates and bank statements. Often times, they push the scam further by asking you to provide a copy of your birth certificate as well as your bank account details. (That being said, it is important to <\/span><i><span style=\"font-weight: 400;\">never<\/span><\/i><span style=\"font-weight: 400;\"> provide a copy of your identification or bank account details to someone you don&#8217;t know, especially over email.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A few things to look out for to spot an inheritance scam is that these cases of receiving money from unknown people who share a last name are never real. Not only that, but there are often spelling\/grammatical errors in the documents they send you, they often ask for processing fees in order to receive the money, or they ask for your bank account details. If at anytime you suspect a scam you should always report it to the FTC. According to ScamWatch, there were 199 reports of inheritance scams in June alone .<\/span><\/p>\n<p><b>Honorable Mentions<\/b><\/p>\n<p><span style=\"font-weight: 400;\">There are a few scams that didn&#8217;t make it to the top 5 because they haven&#8217;t resulted in as much monetary loss as the ones listed above, but there are still popular scams out there that are worth mentioning.<\/span><\/p>\n<p><b>Lottery Scam<\/b><\/p>\n<p><span style=\"font-weight: 400;\">The lottery scam comes in the form of an email congratulating you for winning a large sum of money. The only catch is that in order to receive the money you must first send thousands of dollars to pay for the &#8216;processing fees.&#8217; Often times what happens is that persons become so distracted by the thought of &#8216;winning&#8217; that much money that they tend to forgot they didn&#8217;t enter a raffle or buy a ticket to begin with.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">One of the basic rules to bear in mind when looking into opportunities online, is that if something is too good to be true, it probably is.<\/span><\/p>\n<p><b>Make Money Online Scam<\/b><\/p>\n<p><span style=\"font-weight: 400;\">There are many false online money making opportunities out there. Always insist on payment for work you do for someone immediately, do not agree to wait for months at a time before receiving payment. That way you will not waste a lot of your time working for someone who is not going to end up paying you.<\/span><\/p>\n<p><b>Disaster Relief Scam<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Scammers take advantage of tragic events that leave people devastated. In most cases these people have suffered major loss; this could be the death of loved ones or the loss of property. Scammers know that there are many charities set up to provide disaster relief for these victims. The scammers set up phony charity websites to prey on people who wish to help the victims of these various disasters. At first glance these websites may seem legitimate, but the majority of real charities do not ask for donations online, much less prod you to provide your credit card and\/or bank information.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The fact that the charity is online is a big indication that it is not an authentic charity. If you&#8217;re really convinced that the website is an actual charity, though, then you can double check by trying to contact them over the phone and speaking to one of their agents or representatives over the phone. As an extra safety measure, when donating anything to charity, it&#8217;s always best to visit the office of the organization in person.<\/span><\/p>\n<p><b>Conclusion<\/b><\/p>\n<p><span style=\"font-weight: 400;\">There are several scams out there on the Internet. The best way to stay safe is to be careful and be cautious of anything suspicious. If you&#8217;d like to learn more about avoiding scams then we suggest you check out this list of <\/span><a href=\"https:\/\/www.consumer.ftc.gov\/articles\/0060-10-things-you-can-do-avoid-fraud\"><span style=\"font-weight: 400;\">10 things you can do to avoid fraud<\/span><\/a><span style=\"font-weight: 400;\"> by the Federal Trade Commission (FTC)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Also, if you&#8217;ve spotted a scam or have been scammed be sure to report it to the FTC as you wouldn&#8217;t like others to suffer the same fate you have.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they&#8217;re not careful these days. Everything from pop ups to emails can be potential threats, but gone are the days of obvious attacks. These [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1348,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[35],"tags":[419,420,421,388,422,423],"class_list":["post-1520","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-private-investigations-news","tag-how-to-recognize-online-scam","tag-lose-money-scam","tag-money-scams","tag-online-scams","tag-ponzi-scheme","tag-ponzi-schemes"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.<\/title>\n<meta name=\"description\" content=\"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they&#039;re not careful these days.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"og:description\" content=\"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they&#039;re not careful these days.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2017-08-15T22:29:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:45:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2022\/10\/lauth-investigations-TEAM.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"400\" \/>\n\t<meta property=\"og:image:height\" content=\"80\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"Popular Online Scams of 2017 and How to Avoid Them\",\"datePublished\":\"2017-08-15T22:29:50+00:00\",\"dateModified\":\"2021-04-09T17:45:02+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\"},\"wordCount\":2223,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage\"},\"thumbnailUrl\":\"\",\"keywords\":[\"how to recognize online scam\",\"lose money scam\",\"money scams\",\"online scams\",\"ponzi scheme\",\"ponzi schemes\"],\"articleSection\":[\"Private Investigations News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\",\"url\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\",\"name\":\"Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage\"},\"thumbnailUrl\":\"\",\"datePublished\":\"2017-08-15T22:29:50+00:00\",\"dateModified\":\"2021-04-09T17:45:02+00:00\",\"description\":\"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they're not careful these days.\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Popular Online Scams of 2017 and How to Avoid Them\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.","description":"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they're not careful these days.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/","og_locale":"en_US","og_type":"article","og_title":"Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.","og_description":"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they're not careful these days.","og_url":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2017-08-15T22:29:50+00:00","article_modified_time":"2021-04-09T17:45:02+00:00","og_image":[{"width":400,"height":80,"url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2022\/10\/lauth-investigations-TEAM.jpg","type":"image\/jpeg"}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"Popular Online Scams of 2017 and How to Avoid Them","datePublished":"2017-08-15T22:29:50+00:00","dateModified":"2021-04-09T17:45:02+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/"},"wordCount":2223,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage"},"thumbnailUrl":"","keywords":["how to recognize online scam","lose money scam","money scams","online scams","ponzi scheme","ponzi schemes"],"articleSection":["Private Investigations News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/","url":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/","name":"Popular Online Scams of 2017 and How to Avoid Them | Indiana Private Investigators | Lauth Investigations International, Inc.","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage"},"thumbnailUrl":"","datePublished":"2017-08-15T22:29:50+00:00","dateModified":"2021-04-09T17:45:02+00:00","description":"It used to be that only the old and naive were vulnerable to scams on the internet, however, with the creativity of scammers increasing, even the most tech-savvy can fall victim if they're not careful these days.","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#primaryimage","url":"","contentUrl":""},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/popular-online-scams-2017-avoid\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"Popular Online Scams of 2017 and How to Avoid Them"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1520","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1520"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1520\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1520"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1520"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1520"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}