{"id":1537,"date":"2018-01-09T18:46:19","date_gmt":"2018-01-09T18:46:19","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1520"},"modified":"2021-04-09T17:40:58","modified_gmt":"2021-04-09T17:40:58","slug":"opiates-workplace","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/opiates-workplace\/","title":{"rendered":"Opiates in the Workplace"},"content":{"rendered":"<p style=\"text-align: center;\"><b>Is Your Employee a Drug Trafficker? Opiates in the Workplace<\/b><\/p>\n<p><img fetchpriority=\"high\" fetchpriority=\"high\" decoding=\"async\" class=\"aligncenter wp-image-1521\" src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\" alt=\"Hydrocodone Pills\" width=\"520\" height=\"293\" \/><\/p>\n<p><span style=\"font-weight: 400;\">According to the <\/span><a href=\"https:\/\/www.cdc.gov\/drugoverdose\/data\/prescribing.html\"><span style=\"font-weight: 400;\">Centers for Disease Control and Prevention<\/span><\/a><span style=\"font-weight: 400;\"> (CDC), sales of prescription opioids quadrupled during 1999 to 2014. Referred to as an opioid crisis in America, it seems we all know someone battling an addiction to prescription medications.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Opioids include prescription pills (including Vicodin, Oxycontin, and Percocet), as well as Heroin and Fentanyl, a drug that can be injected, taken as a lozenge or through a skin patch.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Nationwide 1 in 4 people who are prescribed opioids will struggle with addiction. The depth of the problem is highlighted in a disturbing CDC post stating, “<\/span><span style=\"font-weight: 400;\">Almost all prescription drugs involved in overdoses come from prescriptions originally; very few come from pharmacy theft. However, once they are prescribed and dispensed, prescription drugs are frequently diverted to people using them without prescriptions. More than 3 out of 4 people who misuse prescription painkillers use drugs prescribed to someone else.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to the personal toll to the addicts and the American family touched by opioid abuse, the CDC also <\/span><span style=\"font-weight: 400;\">estimates the total &#8220;economic burden&#8221; of prescription opioid misuse alone in the United States is $78.5 billion a year, including the cost of healthcare, loss of productivity, absenteeism, increased injuries, addiction treatment, theft, criminal justice involvement, and legal liabilities.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/www.samhsa.gov\/\"><span style=\"font-weight: 400;\">Substance Abuse and Mental Health Services Administration<\/span><\/a><span style=\"font-weight: 400;\"> (SAMHSA) estimates 68.9% of all drug users are employed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/www.dea.gov\/druginfo\/factsheets.shtml\"><span style=\"font-weight: 400;\">Drug Enforcement Agency<\/span><\/a><span style=\"font-weight: 400;\"> estimates employed persons who misuse opioids account for 64.5% of medically related absenteeism and 90.1% of disability costs. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The use of opioids in the workplace is a growing battle for American business. According to a <\/span><a href=\"http:\/\/www.nsc.org\/pages\/home.aspx\"><span style=\"font-weight: 400;\">National Safety Council<\/span><\/a><span style=\"font-weight: 400;\"> (NCS) survey, 57% of employers perform drug tests. However, more than 40% do not test for synthetic opioids like oxycodone, one of the most abused narcotics on the market, making accurate national statistics unreliable.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">An NCS survey also found 29% of employers reported impaired job performance due to use of painkillers, with 15% citing injuries due to drug use. Up to 70% of employers said their workforce has been negatively affected in one way or another.<\/span><\/p>\n<p style=\"text-align: center;\"><b>The Impact of Drugs in the Workplace<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Use of drugs impairs decision making and causes physical impairment, a deadly condition when at work. It causes an overall decline in employee morale, an unsafe working environment and increases employer liability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is estimated at least 1 of 6 employees use drugs at work and the toll on the workplace is costly in the following ways:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Addicts are 1\/3 less productive than their counterparts<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Five more times likely to cause accidents <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Are absent up to 20 times more often<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Five times more likely to request workers compensation<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Contribute to 40% of all industrial work fatalities<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Health care costs for addicts is three times higher than other employees<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Admitted to selling drugs to coworkers<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Admitted to stealing from employers and coworkers<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">It is estimated 70% of 14.8 million Americans who use illegal drugs are employed. It is safe to assume if you have drug abusers on the job, you probably also have drug dealers operating within your company.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As drug dependency increases, it is common for addicts to buy drugs from friends or coworkers and even steal from their company, co-workers and clients.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Experts have also found the number of heroin addicts have increased as it is common for an opioid user to transition to using heroin when they begin running out of pills and money. Heroin is significantly cheaper than opiates and easier to obtain. Heroin laced with Fentanyl is becoming increasingly popular because it can be 50 times stronger than heroin.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The drug dealer of today is no longer the shady guy driving a decked-out Cadillac, meeting his clients in a dark alley or an unlit street corner. Dealing drugs to coworkers is preferred over standing on the corner selling to strangers and for a drug trafficker, less risky.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At work, a dealer has an employed clientele able to afford the drugs, and someone they can establish trust with while selling under the radar of management in the restroom, parking lot, lunch-room or cubicle. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Oftentimes workplace dealers will sell drugs on credit or a “front” according to the book <\/span><a href=\"https:\/\/www.amazon.com\/gp\/product\/0750670487\/ref=as_li_tl?ie=UTF8&amp;tag=missingleads1-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=0750670487&amp;linkId=c1bcdbdec0ff21e93ee5bb7c0ee39fec\"><span style=\"font-weight: 400;\">Undercover Investigations in the Workplace<\/span><\/a><span style=\"font-weight: 400;\"> by Eugene Ferraro. Drugs are sold to an employee with the agreement of paying later, usually on payday. Co-workers make the perfect client for a drug dealer and quite a lucrative business, with one Oxycontin pill demanding up to $50-$80 each on the street according to a CNN Money article <\/span><a href=\"http:\/\/money.cnn.com\/2011\/06\/01\/news\/economy\/prescription_drug_abuse\/index.htm\"><span style=\"font-weight: 400;\">Prescription Drugs Worth Millions to Dealers<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"size-medium wp-image-1522 alignright lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Cash-300x209.jpg\" alt=\"Cash\" width=\"300\" height=\"209\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 300px; --smush-placeholder-aspect-ratio: 300\/209;\" \/>According to Ferraro, “We have caught employees-dealers (earning less than $10 an hour from their employer) who never carried less than $10,000 cash to work.” <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Paydays are usually the biggest days for drug trafficking activity. However, to pay for drugs, addicts often turn to their employers to fund their habits. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With addicts in the workplace, there is a higher incidence of theft of equipment, tools, products and part inventories where drug trafficking and abuse is occurring. Aside from being at increased risk, both abusers and drug dealers are more likely to become involved in additional criminal behavior, stealing from their employers and fellow employees. <\/span><\/p>\n<p><b>What are the signs of drug trafficking and abuse in the workplace? <\/b><\/p>\n<p><span style=\"font-weight: 400;\">Are certain employees driving an expensive car far beyond the means of what they make working? Flaunting money? Are your employees leaving without notice to meet clients? High turnover and absenteeism and\/or meeting in the bathroom or parking lot? What may appear on the surface to look like comradery, could be a sign of something more. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Robert Avery, 41, worked as the Parental Involvement Director at a Head Start program in Gadsen, Alabama. Instead of offering educational and health services to low-income children, Avery was arrested for selling the prescription drug “Roxycontin” to undercover agents from the program facility.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"><img decoding=\"async\" class=\"wp-image-1523 alignleft lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Robert-Rokard-292x300.jpg\" alt=\"Robert Rokard\" width=\"170\" height=\"175\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 170px; --smush-placeholder-aspect-ratio: 170\/175;\" \/>Even police departments are not immune. November 20, 2017, Jellico Police Department Dispatcher and Fireman Robert Rookard, was arrested in “<\/span><a href=\"http:\/\/thevolunteertimes.com\/campbell\/jellico-official-arrested-as-part-of-operation-thanksgiving-harvest\/\"><span style=\"font-weight: 400;\">Operation Thanksgiving Harvest<\/span><\/a><span style=\"font-weight: 400;\">” for selling drugs at work. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In August 2017, more than a dozen Atlanta USPS workers were rounded up for running an illegal drug distribution operation. Sixteen employees working at post offices across Metro Atlanta were arrested for accepting bribes in exchange for delivering kilogram packages of cocaine. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When the FBI received a tip that drug dealers were running packages of drugs through the mail system, they began an 18-month sting putting a fake drug dealer on the street to see how many postal workers they could get to sign up. In a bribery agreement, workers agreed to provide special addresses to the drug trafficker, intercepting and delivering the packages to the dealer, who just happened to be working with law enforcement. The number of postal workers who agreed to participate astounding. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While some companies may assume there is no liability for the actions of an employee, one company is feeling the devastating effects. According to the October 13, 2017, Chicago Tribune article, “<\/span><a href=\"http:\/\/www.chicagotribune.com\/suburbs\/oak-park\/news\/ct-oak-austin-pantry-ruling-tl-1102-20171027-story.html\"><span style=\"font-weight: 400;\">Oak Park appeals board upholds pantry&#8217;s closure after employee accused of selling heroin<\/span><\/a><span style=\"font-weight: 400;\">,” <\/span><span style=\"font-weight: 400;\">it was reported The Village of Oak Park in Chicago closed the Austin Food Pantry after 55-year old store manager Edgar Lucas was arrested on 17 counts of heroin sales and possession at the establishment. Charges include 5 counts of<\/span> <span style=\"font-weight: 400;\">unlawful delivery of a controlled substance determined to be heroin.<\/span><span style=\"font-weight: 400;\"> In the aftermath, the city revoked their business license. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In an appeal, the store owners stated they had no knowledge of the employee’s drug activities; however, Village of Oak Park trustees upheld the decision to permanently close the business. <\/span><span style=\"font-weight: 400;\">In a written ruling, trustee Cara Pavlick said Austin Pantry owners were &#8220;negligent, reckless and careless at a minimum in allowing their business to be operated as a place for the sale of illegal narcotics on numerous dates.&#8221;<\/span><\/p>\n<p><img decoding=\"async\" class=\"aligncenter wp-image-1524 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Austin-Pantry-300x169.jpg\" alt=\"Austin Pantry\" width=\"522\" height=\"294\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 522px; --smush-placeholder-aspect-ratio: 522\/294;\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Drug use and trafficking are often difficult to spot and many times even harder to prove. However, every employer and Human Resources department has a responsibility to ensure a safe environment for all employees, immediately addressing any infraction or suspicion to reduce liability within the workplace and protect your company.<\/span><\/p>\n<p><b>Private Investigators – A Weapon in Battle to Reduce Illegal Drug Use<\/b><\/p>\n<p><span style=\"font-weight: 400;\">An internal investigation sometimes involves drug-testing, some use dogs, and some use undercover operatives. Wall Street and other large corporations began using private investigations long ago with the demand ever increasing. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">General Motors (GM) reported substance abuse by some of its 472,000 employees and their dependents cost the company $600 million in 1987. To combat the problem, GM instituted undercover operations at 10 mid-western plants and said it would not hesitate to use such investigations in the future. That was then, and drug use in the workplace has only increased.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">While employers are encouraged to practice a covenant of good faith and dealing with all employees, protecting the workplace should be the primary goal, and often requires professional private investigators to work alongside law enforcement to ferret out drug use and other illegal activity.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Conducting a private investigation not only reflects your company as being proactive, careful documentation can help achieve a conviction and reduce liability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Thomas Lauth, owner of <\/span><a href=\"https:\/\/lauthinveststg.wpengine.com\/\"><span style=\"font-weight: 400;\">Lauth Investigations International<\/span><\/a><span style=\"font-weight: 400;\">, specializes in undercover investigations for both blue-collar and white-collar companies. Having spent over 20 years in the field as a private detective, he believes diligence is key to combating workplace crime. “One can never be too careful or diligent when protecting their company. When working with clients, we tailor our investigation to the needs of each individual client.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When hired by a client, Lauth’s investigative team provides an assessment and tailors the investigation to the needs of the specific case. Working with Human Resources, the business is profiled to determine the best course of action. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The most effective way to detect drug trafficking and abuse in the workplace is to conduct a covert investigation planting an investigator within the company. Typically, the investigator goes through the hiring process like any other employee, informing minimal staff, allowing the undercover private investigator to protect their identity and integrity of the investigation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">From there, the investigator fits in with employees, developing friendships to gain information about drug activity. In Lauth’s experience, “Many times, our investigators uncover additional illegal activities, resulting from the initial investigation,” <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Periodic background checks can also assist companies in identifying employees who are high risk for illegal activity. “At Lauth Investigations, we recommend conducting background checks of all employees, newer employees as well as those who have worked for the company for several years. A lot can change after the hiring of an individual,” Lauth says.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For those who may be concerned office morale may be damaged, Lauth points out a background check can be conducted legally without the employee’s knowledge. “Background checks can reveal drug offenses, fraud, theft and other criminal activity on record with a police department or court and one of the most important steps a company can take to protect their company.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For more information contact Thomas Lauth, <\/span><a href=\"https:\/\/lauthinveststg.wpengine.com\/\"><span style=\"font-weight: 400;\">Lauth Investigations<\/span><\/a><span style=\"font-weight: 400;\"> 317-951-1100.<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Written by Lauth Investigations Feature Writer Kym Pasqualini.<\/span><\/i><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is Your Employee a Drug Trafficker? Opiates in the Workplace According to the Centers for Disease Control and Prevention (CDC), sales of prescription opioids quadrupled during 1999 to 2014. Referred to as an opioid crisis in America, it seems we all know someone battling an addiction to prescription medications. Opioids include prescription pills (including Vicodin, Oxycontin, and Percocet), [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[35],"tags":[276,73,16,329,323,216,51,56,57,135,136,52,49,80,84,140,285],"class_list":["post-1537","post","type-post","status-publish","format-standard","hentry","category-private-investigations-news","tag-corporate-investigations-2","tag-criminal-investigation","tag-employee-theft","tag-human-resources","tag-indiana-private-investigator","tag-indianapolis-private-investigation","tag-internal-theft","tag-investigations","tag-investigators","tag-kym-pasqualini","tag-lauth-investigations","tag-prevent-internal-theft","tag-prevention","tag-private-investigators","tag-professional-private-investigator","tag-thomas-lauth","tag-workplace-investigation"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Drug Trafficking in the Workplace<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Drug Trafficking in the Workplace\" \/>\n<meta property=\"og:description\" content=\"Is Your Employee a Drug Trafficker? Opiates in the Workplace According to the Centers for Disease Control and Prevention (CDC), sales of prescription opioids quadrupled during 1999 to 2014. Referred to as an opioid crisis in America, it seems we all know someone battling an addiction to prescription medications. Opioids include prescription pills (including Vicodin, Oxycontin, and Percocet), [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-09T18:46:19+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:40:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"Opiates in the Workplace\",\"datePublished\":\"2018-01-09T18:46:19+00:00\",\"dateModified\":\"2021-04-09T17:40:58+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\"},\"wordCount\":1811,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\",\"keywords\":[\"corporate investigations\",\"criminal investigation\",\"employee theft\",\"human resources\",\"Indiana private investigator\",\"indianapolis private investigation\",\"Internal theft\",\"Investigations\",\"Investigators\",\"kym pasqualini\",\"lauth investigations\",\"Prevent Internal Theft\",\"Prevention\",\"Private investigators\",\"professional private investigator\",\"thomas lauth\",\"workplace investigation\"],\"articleSection\":[\"Private Investigations News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\",\"url\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\",\"name\":\"Drug Trafficking in the Workplace\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\",\"datePublished\":\"2018-01-09T18:46:19+00:00\",\"dateModified\":\"2021-04-09T17:40:58+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/opiates-workplace\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage\",\"url\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\",\"contentUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/opiates-workplace\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Opiates in the Workplace\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Drug Trafficking in the Workplace","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/opiates-workplace\/","og_locale":"en_US","og_type":"article","og_title":"Drug Trafficking in the Workplace","og_description":"Is Your Employee a Drug Trafficker? Opiates in the Workplace According to the Centers for Disease Control and Prevention (CDC), sales of prescription opioids quadrupled during 1999 to 2014. Referred to as an opioid crisis in America, it seems we all know someone battling an addiction to prescription medications. Opioids include prescription pills (including Vicodin, Oxycontin, and Percocet), [&hellip;]","og_url":"https:\/\/lauthinvestigations.com\/opiates-workplace\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2018-01-09T18:46:19+00:00","article_modified_time":"2021-04-09T17:40:58+00:00","og_image":[{"url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg","type":"","width":"","height":""}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"Opiates in the Workplace","datePublished":"2018-01-09T18:46:19+00:00","dateModified":"2021-04-09T17:40:58+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/"},"wordCount":1811,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg","keywords":["corporate investigations","criminal investigation","employee theft","human resources","Indiana private investigator","indianapolis private investigation","Internal theft","Investigations","Investigators","kym pasqualini","lauth investigations","Prevent Internal Theft","Prevention","Private investigators","professional private investigator","thomas lauth","workplace investigation"],"articleSection":["Private Investigations News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/opiates-workplace\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/","url":"https:\/\/lauthinvestigations.com\/opiates-workplace\/","name":"Drug Trafficking in the Workplace","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg","datePublished":"2018-01-09T18:46:19+00:00","dateModified":"2021-04-09T17:40:58+00:00","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/opiates-workplace\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#primaryimage","url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg","contentUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Hydrocodone-Pills-300x169.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/opiates-workplace\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"Opiates in the Workplace"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1537","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1537"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1537\/revisions"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1537"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1537"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1537"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}