{"id":1552,"date":"2018-01-25T16:56:20","date_gmt":"2018-01-25T16:56:20","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1552"},"modified":"2021-04-09T17:40:19","modified_gmt":"2021-04-09T17:40:19","slug":"canadian-pharma-billionaire-homicide","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/","title":{"rendered":"Canadian Pharma Billionaire Homicide"},"content":{"rendered":"<p style=\"text-align: center;\"><strong>Canadian Pharma Billionaire and Wife Murders Unsolved<\/strong><\/p>\n<p style=\"text-align: center;\"><strong> Family Hires Team of Private Investigators<\/strong><\/p>\n<p> “Big Pharma Tycoon” Dr. Barry Sherman, Ph.D., 75, and his wife Honey, 70, were found dead in their Toronto, Canada home on December 15, 2017.<\/p>\n<p>Media initially reported their deaths as a “murder-suicide,” but Sherman’s children all emphatically disagree with the initial police assessment.<\/p>\n<div id=\"attachment_1553\" style=\"width: 538px\" class=\"wp-caption aligncenter\"><img fetchpriority=\"high\" fetchpriority=\"high\" decoding=\"async\" aria-describedby=\"caption-attachment-1553\" class=\" wp-image-1553\" src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\" alt=\"Dr. Barry Sherman and his wife Honey\" width=\"528\" height=\"297\" \/><p id=\"caption-attachment-1553\" class=\"wp-caption-text\"><em>Dr. Barry Sherman and his wife Honey<\/em><\/p><\/div>\n<p><a href=\"http:\/\/www1.apotex.com\/global\">Apotex Pharmaceutical Holdings, Inc<\/a>. is Canada’s largest maker of generic drugs, earning the Shermans a fortune estimated at $4.7 billion, placing Barry Sherman as the 12<sup>th<\/sup> wealthiest person in Canada, according to Forbes Magazine.<\/p>\n<p>Apotex was founded by Sherman in 1974 and grew from a two-person operation to employing over 11,000 people.  The company sells approximately 300 generic drugs within 120 countries.<\/p>\n<p>Dr. Sherman had a Ph.D. in astrophysics from MIT and had formerly been the Chairman of former Cangene Corp., a Canadian biotechnology firm specializing in hyper immunes, contract manufacturing, biopharmaceuticals, and biodefense.  It has been reported the company had several bioterrorism contracts with the United States before the company sold in 2014.<\/p>\n<p>Honey Sherman had been active in service to the community and had been awarded a “Community Service Award” from Canadian senator Linda Frum.<\/p>\n<p>“I am gutted by the loss of Honey and Barry Sherman. Our community is steeped in grief. I am heartbroken,” Frum posted on Twitter.<\/p>\n<div id=\"attachment_1554\" style=\"width: 542px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1554\" class=\"wp-image-1554 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Sherman-Mansion-300x188.jpg\" alt=\"Sherman 12,440 square foot mansion in North York, Toronto\" width=\"532\" height=\"334\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 532px; --smush-placeholder-aspect-ratio: 532\/334;\" \/><p id=\"caption-attachment-1554\" class=\"wp-caption-text\"><em>Sherman 12,440 square foot mansion in North York, Toronto<\/em><\/p><\/div>\n<p>Described as “incredible philanthropists” and beloved members of Canada’s Jewish community, their deaths have shocked their neighborhood of North York, along with medical and political circles throughout the world.<\/p>\n<p><strong>Sherman’s Children Issue Press Release<\/strong><\/p>\n<p>Sherman’s four children say a murder-suicide made absolutely no sense and proceeded to issue a statement.<\/p>\n<p>“Our parents shared an enthusiasm for life and commitment to their family and community. This is totally inconsistent with the rumors regrettably circulating in the media as to the circumstances surrounding their deaths,” the statement read.<\/p>\n<p>“We are shocked and think it irresponsible that police sources have reportedly advised the media of a theory which neither their family, their friends nor their colleagues believe to be true,” the Sherman children said in the statement. “We urge the Toronto Police Service to conduct a thorough, intensive, and objective criminal investigation, and urge the media to refrain from further reporting as to the cause of these tragic deaths until the investigation is completed.”<\/p>\n<div id=\"attachment_1555\" style=\"width: 552px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1555\" class=\"wp-image-1555 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Sherman-Body-Removal-300x150.jpg\" alt=\"Body being removed from Sherman's Toronto home\" width=\"542\" height=\"271\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 542px; --smush-placeholder-aspect-ratio: 542\/271;\" \/><p id=\"caption-attachment-1555\" class=\"wp-caption-text\"><em>Body being removed from Sherman&#8217;s Toronto home<\/em><\/p><\/div>\n<p>The full story of what happened is not known but according to sources in various reports, the last time the couple was heard from was the evening of December 13<sup>th<\/sup>. They both arrived at their Old Colony neighborhood residence in two cars Wednesday evening after meeting with an architect for a home they were planning to build in Forest Hill, about a 20-mile drive south.<\/p>\n<p>Barry, a self-admitted “workaholic”, didn’t show up at his office the following day but this didn’t cause immediate concern. The couple were found deceased in the downstairs indoor pool area of their home tied to a sturdy railing with two men’s leather belts, each around their necks. It is said they still had their winter coats and boots on.<\/p>\n<p>A murder-suicide just didn’t correspond with their activities or mindset prior to their deaths. They were building a new home and celebrating the birth of a new grandchild. They were planning a wedding and booked airline tickets to fly to Florida for the holidays. Barry was about to become a member of the <a href=\"https:\/\/www.gg.ca\/honours.aspx?lan=eng\">Order of Canada<\/a>, an honor he valued.<\/p>\n<p><strong>Family Hires Criminal Lawyer and Private Investigators<\/strong><\/p>\n<p>According to Business Insider, “<a href=\"http:\/\/www.businessinsider.com\/lawyer-to-barry-sherman-family-criticises-police-investigation-2018-1\">The mysterious death of billionaire Barry Sherman remains unexplained – and the family’s lawyer has criticized the police investigation<\/a>,” the Sherman children immediately hired a criminal attorney.<\/p>\n<p>Powerful criminal attorney, Brian Greenspan, has disapproved of the police handling of the investigation, demanding a second autopsy. The autopsy was conducted by a forensic pathologist on December 20, 2017, producing shocking results.<\/p>\n<p>The forensic pathologist and former Toronto homicide detective found markings on the victim’s wrists consistent with being tied with a cord or plastic zip ties. However, when the bodies were found their wrists were not tied and no cords or rope were found at the scene.<\/p>\n<p>The forensic pathologist also conducted a toxicology report, concluding no signs of drug use.<\/p>\n<p>The Shermans were buried on December 21, 2017.<\/p>\n<p>Greenspan has hired a private investigation team, including former homicide detectives, to ensure “no stone is left unturned” and work alongside police.<\/p>\n<p>The team has concluded the couple had been strangled to death with two men’s leather belts around their necks and attached to the sturdy bar.<\/p>\n<p><strong>Police Theory Debunked<\/strong><\/p>\n<p>The Sherman’s real estate agent discovered the deceased couple in the basement of their $5.4 million home.<\/p>\n<p><img decoding=\"async\" class=\"aligncenter  wp-image-1556 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Sherman-Home-For-Sale-300x225.jpg\" alt=\"Sherman Home For Sale\" width=\"457\" height=\"343\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 457px; --smush-placeholder-aspect-ratio: 457\/343;\" \/><\/p>\n<p>In a Business Insider article, “<a href=\"http:\/\/www.businessinsider.com\/barry-sherman-canada-apotex-billionaire-justin-trudeau-political-lobbying-scandal-2017-12\">Mystery still shrouds the death of Barry Sherman, the Canadian billionaire found strangled in the basement of his $5.4 million mansion<\/a>,” reports police have now marked the deaths as “suspicious” and a homicide – but not murder.<\/p>\n<p>A Toronto Sun cited “sources close to the case” believe Honey may have been killed in another location of the house, then moved to the lower level of the home where their bodies were found.<\/p>\n<p>Thomas Lauth, CEO of <a href=\"https:\/\/lauthinveststg.wpengine.com\">Lauth Investigations International<\/a>, has 20 years of experience working alongside police agencies and prosecutors on unsolved murder cases. “In any homicide case, one must look at the circumstances from every viewpoint, even what may seem inconceivable,” Lauth said.  “In addition to a thorough forensic examination of the crime scene, it becomes crucial to be able to analyze a crime scene for the unseen, and for anything that may create an “at risk” circumstance where someone is at higher risk to become a victim of crime be it their personal lives, business acquaintances, political activities, wealth, or all of the above.”<\/p>\n<p><strong>Political Lobbying<\/strong><\/p>\n<p>August 6, 2015, Barry and Honey hosted a private $1,500 per-head fundraiser for the Liberal Party at his home. The lavish event was attended by “movers and shakers” and dignitary Justin Trudeau, who became the Canadian prime minister two months later.<\/p>\n<p>Reported in New Canadian Media “<a href=\"http:\/\/www.cjnews.com\/news\/canada\/jdl-protesters-greet-trudeau-private-fundraiser\">JDL protesters greet Trudeau at private fundraiser<\/a>,” about 30 protesters organized by the Jewish <a href=\"http:\/\/www.jdl-canada.com\/\">Defense League of Canada<\/a>, gathered outside the Sherman home to voice their displeasure of the reception given to the Liberal leader despite the Liberal party endorsing the nuclear deal with Iran.<\/p>\n<p>“It is unprecedented to protest at the home of a Jewish leader,” acknowledged Meir Weinstein. If the Liberal party hadn’t backed an agreement deemed by the government of Israel to be dangerous, “we wouldn’t be here.” As Trudeau pulled up in his black van, protesters shouted, No Iran deal!” and the protest seemed to frighten attendees and community residents.<\/p>\n<div id=\"attachment_1557\" style=\"width: 486px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1557\" class=\"wp-image-1557 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Justin-Trudeau-300x193.jpg\" alt=\"Justin Trudeau\" width=\"476\" height=\"306\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 476px; --smush-placeholder-aspect-ratio: 476\/306;\" \/><p id=\"caption-attachment-1557\" class=\"wp-caption-text\"><em>Justin Trudeau, Canada Prime Minister, friend of Barry Sherman<\/em><\/p><\/div>\n<p>The Defense League was criticized for their protest and Weinstein eventually apologized for a “personal inconvenience” in a civil phone call to Sherman; however, the damage had been done.<\/p>\n<p>A government watchdog group, <a href=\"http:\/\/democracywatch.ca\/\">Democracy Watch<\/a>, filed a complaint against Sherman and Apotex, and in January 2017, an investigation was initiated by Canada’s Federal Lobby Commissioner to see if the fundraiser had violated government rules stating, “a lobbyist cannot lobby officials they assisted in getting elected.”<\/p>\n<p>Sherman sued the Lobby Commissioner to shut down the investigation and called the investigation an “unanchored fishing expedition pursued in bad faith.”<\/p>\n<p>Despite Sherman’s death the lobbying commission, Karen Shepherd, confirmed the investigation would proceed.<\/p>\n<p><strong>Could the Sherman’s be victims of a professional hit?<\/strong><\/p>\n<p>The Toronto Sun newspaper asks that question in “<a href=\"http:\/\/torontosun.com\/news\/local-news\/warmington-questions-linger-about-deaths-of-barry-and-honey-sherman\">WARMINGTON: More questions about deaths of Barry and Honey Sherman<\/a>.”<\/p>\n<p>From all accounts, the couple was adored by family, friends and the community. Their relationship was solid and their life together peaceful and loving; however, everything needs to be considered when a murder occurs.<\/p>\n<p>Barry had been sued by his cousins, the children of Lois Winter, who had helped him build his “pharma empire” in the early days. Kerry, Paul, Dana and Jeffrey Winter are four brothers who made allegations Sherman owed them 20 percent stake in Apotex based on sign contracts and verbal agreements signed when Sherman acquired their father’s company, Empire Companies, during the 1960s.<\/p>\n<p>The case dragged on for nearly a decade, but a judge dismissed the claim against Sherman, in the months preceding their deaths.<\/p>\n<p>The Sun article poses several questions that are certainly not out of the realm of possibility when one is worth over $4 billion and your professional life deals with the “cut-throat” business of pharmaceutical sales and even bioterrorism contracts.<\/p>\n<p>As a pharmaceutical company, Sherman made his wealth by reverse engineering patented drugs from established drug companies. Sherman was also known as a “bulldog” who was not intimidated by others.<\/p>\n<p><strong>Motives? Maybe.<\/strong><\/p>\n<p>Former Toronto Police homicide detective, Tom Klatt of <a href=\"http:\/\/www.klattinvestigations.com\">Klatt Investigations<\/a>, has been brought on board to work in tandem with police and ensure “all out-of-the-box possibilities are looked at.” Klatt is a police veteran with more than 70 homicide investigations under his belt. Described as a consummate professional, very smart and a straight shooter.<\/p>\n<p>Attorney Greenspan felt it necessary to hire a team of distinguished law enforcement officers to address the family’s concerns that no murder-suicide occurred as originally reported in the press.<\/p>\n<p>The examination of Sherman’s death has now risen to the largest homicide investigations in Toronto history.<\/p>\n<p>“Sometimes, it is necessary for a family to advocate for their loved ones,” Thomas Lauth says, reflecting upon his own experience working with police and prosecutors. “Hiring a team of investigators ensures everything that can be done is being done. It is necessary in the pursuit of justice.”<\/p>\n<div id=\"attachment_1558\" style=\"width: 603px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1558\" class=\"wp-image-1558 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Sherman-Children-at-funeral-300x168.jpg\" alt=\" Jonathon Sherman cries as he speaks during a memorial service for his parents, Barry and Honey Sherman, as his sisters look on Thursday, December 21, 2017. (Nathan Denette\/The Canadian Press)\" width=\"593\" height=\"332\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 593px; --smush-placeholder-aspect-ratio: 593\/332;\" \/><p id=\"caption-attachment-1558\" class=\"wp-caption-text\"><em>Jonathon Sherman cries as he speaks during a memorial service for his parents, Barry and Honey Sherman, as his sisters look on Thursday, December 21, 2017. (Nathan Denette\/The Canadian Press)<\/em><\/p><\/div>\n<p>At the Sherman home, sewers have been swept for possible evidence, vehicles were removed and surveillance within the home and neighborhood has been secured. Again, sources have said a second crime scene within the home has been carefully analyzed.<\/p>\n<p>Speaking at the funeral, Jonathan Sherman says of his parents, “Our parents never left anyone behind.”<\/p>\n<p>Still so many questions remain but one thing for sure is the couple died of ligature neck compressions. They were found sitting with legs out straight and sources describe them both wearing jackets that were around their arms and pulled down behind their backs.<\/p>\n<p>“A private investigator is a second set of eyes and ears in a murder investigation and we must remain cognizant that whoever murdered Barry and Honey Sherman, remains on the street and a danger to others, not to mention the importance of justice for the family,” said Lauth. “I am convinced if anything was missed in the initial police search, Klatt with his investigative skills, will find it.”<\/p>\n<p><em>Written by Kym L. Pasqualini <\/em><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Canadian Pharma Billionaire and Wife Murders Unsolved Family Hires Team of Private Investigators  “Big Pharma Tycoon” Dr. Barry Sherman, Ph.D., 75, and his wife Honey, 70, were found dead in their Toronto, Canada home on December 15, 2017. Media initially reported their deaths as a “murder-suicide,” but Sherman’s children all emphatically disagree with the initial [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[274],"tags":[73,219,118,322,323,216,56,57,135,136,158,19,140,172],"class_list":["post-1552","post","type-post","status-publish","format-standard","hentry","category-personal-investigations","tag-criminal-investigation","tag-hire-private-investigator","tag-homicide","tag-indiana","tag-indiana-private-investigator","tag-indianapolis-private-investigation","tag-investigations","tag-investigators","tag-kym-pasqualini","tag-lauth-investigations","tag-private-investigations","tag-private-investigator","tag-thomas-lauth","tag-unsolved-homicide-investigation"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.<\/title>\n<meta name=\"description\" content=\"Unsolved Homicide Investigations\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"og:description\" content=\"Unsolved Homicide Investigations\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2018-01-25T16:56:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:40:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"Canadian Pharma Billionaire Homicide\",\"datePublished\":\"2018-01-25T16:56:20+00:00\",\"dateModified\":\"2021-04-09T17:40:19+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\"},\"wordCount\":1845,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\",\"keywords\":[\"criminal investigation\",\"hire private investigator\",\"homicide\",\"Indiana\",\"Indiana private investigator\",\"indianapolis private investigation\",\"Investigations\",\"Investigators\",\"kym pasqualini\",\"lauth investigations\",\"private investigations\",\"private investigator\",\"thomas lauth\",\"unsolved homicide investigation\"],\"articleSection\":[\"Personal Investigations\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\",\"url\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\",\"name\":\"Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\",\"datePublished\":\"2018-01-25T16:56:20+00:00\",\"dateModified\":\"2021-04-09T17:40:19+00:00\",\"description\":\"Unsolved Homicide Investigations\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage\",\"url\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\",\"contentUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Canadian Pharma Billionaire Homicide\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.","description":"Unsolved Homicide Investigations","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/","og_locale":"en_US","og_type":"article","og_title":"Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.","og_description":"Unsolved Homicide Investigations","og_url":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2018-01-25T16:56:20+00:00","article_modified_time":"2021-04-09T17:40:19+00:00","og_image":[{"url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg","type":"","width":"","height":""}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"Canadian Pharma Billionaire Homicide","datePublished":"2018-01-25T16:56:20+00:00","dateModified":"2021-04-09T17:40:19+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/"},"wordCount":1845,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg","keywords":["criminal investigation","hire private investigator","homicide","Indiana","Indiana private investigator","indianapolis private investigation","Investigations","Investigators","kym pasqualini","lauth investigations","private investigations","private investigator","thomas lauth","unsolved homicide investigation"],"articleSection":["Personal Investigations"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/","url":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/","name":"Canadian Pharma Billionaire Homicide | Indiana Private Investigators | Lauth Investigations International, Inc.","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg","datePublished":"2018-01-25T16:56:20+00:00","dateModified":"2021-04-09T17:40:19+00:00","description":"Unsolved Homicide Investigations","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#primaryimage","url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg","contentUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/01\/Barry-Sherman-and-Honey-300x169.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/canadian-pharma-billionaire-homicide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"Canadian Pharma Billionaire Homicide"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1552","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1552"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1552\/revisions"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1552"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1552"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1552"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}