{"id":1617,"date":"2018-02-23T10:57:50","date_gmt":"2018-02-23T10:57:50","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1617"},"modified":"2021-04-09T17:38:58","modified_gmt":"2021-04-09T17:38:58","slug":"snapchat-murders-cold-case","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/","title":{"rendered":"Snapchat Murders: Not a Cold Case"},"content":{"rendered":"<p style=\"text-align: center;\"><strong>By: Kym Pasqualini, Feature Crime Writer for Lauth Investigations<\/strong><\/p>\n<p>On February 13, 2017, best friends Abigail “Abby” Williams, 13, and Liberty “Libby” German, 14, planned to go hiking near the beautiful area of Monon High Bridge Trail, east of their small town of Delphi, Indiana.<\/p>\n<div id=\"attachment_1618\" style=\"width: 593px\" class=\"wp-caption aligncenter\"><img fetchpriority=\"high\" fetchpriority=\"high\" decoding=\"async\" aria-describedby=\"caption-attachment-1618\" class=\" wp-image-1618\" src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\" alt=\"Libby German and Abby Williams, Best Friends\" width=\"583\" height=\"408\" \/><p id=\"caption-attachment-1618\" class=\"wp-caption-text\"><em>Libby German and Abby Williams, Best Friends<\/em><\/p><\/div>\n<p>At approximately 1:45 p.m. that afternoon, a family member dropped them off at the abandoned bridge where they planned to hike. It was agreed they would meet their family back in the same location later in the afternoon.  They both had the day off school, it was an unseasonably warm winter day, and Abby Abby and Libby shared a special friendship. They both loved hiking, taking photographs of flowers and trees, and adventuring the scenic trails about a mile east of their home.<\/p>\n<p>Libby posted, this now haunting photo, while atop Indiana’s second highest bridge on her Snapchat at 2: 07 p.m. This was the last post anyone would see the two girls alive.<\/p>\n<div id=\"attachment_1619\" style=\"width: 667px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1619\" class=\"wp-image-1619 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-Walking-300x169.jpg\" alt=\"Photograph Libby German posted on Snapchat of Abby Williams walking on the Monon High Bridge, Dephi, IN.\" width=\"657\" height=\"370\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 657px; --smush-placeholder-aspect-ratio: 657\/370;\" \/><p id=\"caption-attachment-1619\" class=\"wp-caption-text\"><em>Photograph Libby posted on Snapchat of Abby  walking on the Monon High Bridge, Dephi, IN.<\/em><\/p><\/div>\n<p>When the girls did not show up at the agreed upon the location as planned, the family reported the girls missing to Delphi Police Department and the local sheriff. Immediately police and firefighters were dispatched to canvas the area.<\/p>\n<p>Over 100 searchers responded to the area. Arial searches began utilizing the remaining daylight hours. Later the same evening, authorities began trying to “ping” the girl’s phones, with no success. The sheriff stated he felt the girl’s phones were either turned off or the batteries had gone dead.<\/p>\n<div id=\"attachment_1620\" style=\"width: 684px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1620\" class=\"wp-image-1620 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Police-search-300x202.jpg\" alt=\"Police searching for Abby and Libby in the area surrounding Monon High Bridge and Deer Creek trails.\" width=\"674\" height=\"453\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 674px; --smush-placeholder-aspect-ratio: 674\/453;\" \/><p id=\"caption-attachment-1620\" class=\"wp-caption-text\"><em>Police searching for Abby and Libby in the area surrounding Monon High Bridge and Deer Creek trails.<\/em><\/p><\/div>\n<p>At approximately midnight, the search was called off, though volunteers continued searching throughout the night. The search resumed the following morning along Deer Creek and farther out from the trail. Searchers prayed the girls had simply been lost but soon those hopes were dashed. Approximately one mile from where the two young girls vanished, searchers found two bodies on a piece of private property along Deer Creek, north of the bridge.<\/p>\n<p>February 14, 2017, at approximately 1:50 p.m., Sheriff Leazenby, Delphi Police Chief Steve Mullins and Indiana State Police (ISP) representative Kim Riley held a joint press conference to announce two bodies were found during the search for Abby and Libby, stating the bodies had yet to be identified.<\/p>\n<p>February 15, 2017, 2:33 p.m., authorities held another press conference and announced the bodies had been identified as Liberty German and Abigail Williams.<\/p>\n<p>A community was heartbroken. Children were terrified, and parents held their children closer.<\/p>\n<p style=\"text-align: center;\"><strong>Haunting Images and Audio Found on Libby’s Phone<\/strong><\/p>\n<p>At the February 15<sup>th<\/sup> news conference, ISP proceeded to release a photo of an unidentified man walking along the Delphi Historic Trail found on the girl’s phone. Authorities announced they wanted to speak to anyone who had parked in the nearby lot or anywhere around the trail the day the girls had visited the park.<\/p>\n<div id=\"attachment_1621\" style=\"width: 629px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1621\" class=\"wp-image-1621 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Suspect-in-Abby-and-Libbys-Murder-300x158.jpg\" alt=\"FBI names individual in photograph suspect in murder of Delphi girls.\" width=\"619\" height=\"326\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 619px; --smush-placeholder-aspect-ratio: 619\/326;\" \/><p id=\"caption-attachment-1621\" class=\"wp-caption-text\"><em>FBI names individual in photograph suspect in murder of Delphi girls.<\/em><\/p><\/div>\n<p>Five months into the investigation, ISP released a composite sketch of the man on the bridge hoping someone may recognize him and make a call.<\/p>\n<p>Chilling <a href=\"https:\/\/www.youtube.com\/watch?v=m7LopVJddaU\">audio<\/a> of the killer’s voice Libby captured on her phone was also released generating thousands of leads.<\/p>\n<p><img decoding=\"async\" class=\"size-medium wp-image-1622 alignleft lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Sketch-224x300.jpg\" alt=\"Sketch\" width=\"224\" height=\"300\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 224px; --smush-placeholder-aspect-ratio: 224\/300;\" \/><\/p>\n<p>In an Indy Channel report, “<a href=\"https:\/\/www.theindychannel.com\/longform\/delphi-investigation-why-state-police-say-libby-abbys-case-isnt-cold\">Delphi Investigation: Why state police say Libby and Abby’s case isn’t cold<\/a>,” Indiana State Police Superintendent Doug Carter says, “There’s a person out there that knows who did it. Not a hunch. They know who that person is,” said Carter. “They know that voice and they know those clothes. They know that posture. They know that stance and they know who murdered those two little girls in that quiet place.”<\/p>\n<p>March 1, 2017, former Indianapolis Colts punter Pat McAfee and team owner Jim Irsay donate $97,000 to the reward fund. The reward is now $230,000 for information leading to the arrest and prosecution of the individual who murdered Abby and Libby.<\/p>\n<p>In an ABC RTV6 report, “Delphi, Indiana: FBI seeks tips on behavioral changes to help catch Delphi killer,” the FBI makes a plea to the public to think back to Monday, February 13th, the day the Delphi teens went missing asking questions like, “Did someone you know make an excuse for missing an appointment?”<\/p>\n<p>“Just think if you had an interaction with an individual who inexplicably canceled an appointment that you had together,” said Greg Massa of the FBI. “Or an individual called into work sick and canceled a social engagement. At the time, they gave what you thought would have been a plausible explanation. ‘My cell phone broke’ or ‘I had a flat tire on my car.’ In retrospect, (that) excuse no longer holds water,” Massa added.<\/p>\n<p>Other behaviors might now be considered suspicious. It is often a seemingly inconsequential detail someone calls in that can break a case wide open.<\/p>\n<p>“Did an individual travel unexpectedly?” Massa said. “Did they change their appearance? Did they shave their beard, cut their hair or change the color of their hair? Did they change the way they dress?”<\/p>\n<p>Even behavioral changes occurring shortly after February 13, 2017:<\/p>\n<ul>\n<li>Someone who developed a different sleep pattern<\/li>\n<li>Started abusing drugs or alcohol<\/li>\n<li>Has become anxious or irritable<\/li>\n<li>Someone who has followed this case to an extreme<\/li>\n<li>A person who has ongoing conversations about where they were February 13<sup>th<\/sup><\/li>\n<li>Someone who has visited the location where the girls were murdered<\/li>\n<li>Someone who has taken photographs around the trail and bridge<\/li>\n<\/ul>\n<p>Police say don’t ever feel bad about reporting odd behavior. It could have everything to do with finding justice for two little girls brutally murdered. It could save other children from a similar and tragic outcome. In addition, if the person is innocent, it will only take a couple minutes of their time and they will never know you were the one who made the report.<\/p>\n<p style=\"text-align: center;\"><strong>A Person of Interest Dismissed<\/strong><\/p>\n<p>Johnson County Sheriff’s Office sent officers to Colorado to retrieve a “person of interest” in the murders of Abby and Libby.<\/p>\n<p><img decoding=\"async\" class=\"size-medium wp-image-1623 alignright lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Daniel-Nations-300x219.jpg\" alt=\"Daniel Nations\" width=\"300\" height=\"219\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 300px; --smush-placeholder-aspect-ratio: 300\/219;\" \/><\/p>\n<p>Daniel Nations had been arrested in Colorado for threatening hikers with a hatchet on a Colorado trail. Investigators traveled to Colorado to question Nations.<\/p>\n<p>Nations was wanted on an outstanding warrant in Johnson County, Indiana for failing to register as a sex offender so authorities brought him back for further questioning in the Delphi murders.<\/p>\n<p>Police have not formally named Nations as a suspect stating they have no information specifically including or excluding Nations in the killings. However, ISP has since said they are no longer actively investigating Nations as a person of interest in the case.<\/p>\n<p style=\"text-align: center;\"><strong>Memories Keep the Families Going<\/strong><\/p>\n<p>In “<a href=\"https:\/\/www.youtube.com\/watch?v=m7LopVJddaU\">Delphi Daughters: The Untold Story of Abby and Libby<\/a>”, a News 6 report, Mike Patty Libby’s grandfather states, “They didn’t leave each other’s side,” about the afternoon the two girls vanished. “I don’t know what happened out there that day, whether there was a chance or an opportunity for one to break off or split, or make a break for it or whatever but you know, I look at it as two young soldiers who covered each other’s backs, two best friends, I wouldn’t leave my best friend’s side. Neither did they.”<\/p>\n<p>They both loved music. Both played the Alto Saxophone in their middle school band. They loved photography and painting, and both were signed up to play softball.<\/p>\n<p>Life has changed for both families. Libby is remembered as the “baker” of the family. She loved making chocolate chips cookies. Becky Patty, Libby’s grandmother said, “She was a baker. She could throw a batch of cookies together like no other.”<\/p>\n<p>Libby loved using sticky notes. She would leave sticky notes on her grandmother’s car visor. One read, “I love you! Thank you for everything you do for me and Kelsie – Libby.” She would leave sticky notes all over the house, even giving her teachers sticky notes, and always showing her appreciation for everyone around her.<\/p>\n<div id=\"attachment_1624\" style=\"width: 621px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1624\" class=\"wp-image-1624 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-together-300x225.jpg\" alt=\"Abby and Libby together\" width=\"611\" height=\"458\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 611px; --smush-placeholder-aspect-ratio: 611\/458;\" \/><p id=\"caption-attachment-1624\" class=\"wp-caption-text\"><em>Libby German and best friend Abby Williams, loved and remembered by all who knew them.<\/em><\/p><\/div>\n<p>In the aftermath of her murder, Libby’s class presented her grandparents with jars filled with “sticky note” messages from each child. A way of dealing with the loss for her classmates, and a reminder of how much she is missed.<\/p>\n<p>Libby had dreamed of becoming a science teacher and loved finding cures and solving crimes, so much so, she took additional classes at Purdue University.<\/p>\n<p>Like Libby, Arika Gibson, a friend of the pair said, “Abby also dreamed of doing something within forensics and police work.” For two amateur sleuths, clearly, the evidence the girls left on their cell phones was clues to their own murders.<\/p>\n<p>Abby Williams’ grandparents, whom she called Mee-maw and Papaw, keep her belongings right where they were the day she disappeared. “We just can’t erase her from our lives, we just don’t want to.”  She added, “We treasure her coat hanging on the coat hook, her shoes on the shoe rack and her bedroom just the way she left it – she may have walked out the door, but she is here with us,” said Diane Erskin, Abby’s grandmother. With tears in Abby’s mother’s eyes, Anna Williams added, “Abby smiled all the time.” Her voice to a whisper, “All the time.”<\/p>\n<p>Abby’s favorite thing to say was, “Is there anything I can do to help?” Always with a joyful spirit. Anna and her daughter Abby both shared a love of photography. She loved arts and crafts even knitting hat for newborns with her Aunt Maggie. She was especially good at volleyball and had planned on starting softball with Libby in the new year. Her grandfather Cliff was so excited he drove down from Michigan to take Abby out shopping to buy all new gear.<\/p>\n<p style=\"text-align: center;\"><strong>Investigation Continues at God Speed<\/strong><\/p>\n<p>The search for a killer has reached national proportions. Approximately 6,000 electronic billboards in 46 states have been utilized to solicit information from the public.<\/p>\n<div id=\"attachment_1625\" style=\"width: 699px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1625\" class=\"wp-image-1625 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-Billboard-300x169.jpg\" alt=\"Billboards with information about the Delphi murders have been placed throughout the country.\" width=\"689\" height=\"388\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 689px; --smush-placeholder-aspect-ratio: 689\/388;\" \/><p id=\"caption-attachment-1625\" class=\"wp-caption-text\"><em>Billboards with information about the Delphi murders have been placed throughout the country.<\/em><\/p><\/div>\n<p>A year later, investigators have received over 30,000 tips and interviewed thousands of potential suspects.<\/p>\n<p>ISP, FBI, Carroll County Sheriff and the Delphi Police Department still follow up leads and vow to solve this murder case.<\/p>\n<p>Investigators have a motto, “Today is the day,” and each day at the department, the day starts out with a prayer. “As we gather together today for our work we have been assigned to, let’s pray,” as each investigator bows their head.<\/p>\n<p>“Today’s the day, today is the day we are going to get closer to the end, today is the day we are going to get closer to getting justice for Abby and Libby,” said ISP First Sergeant Jerry Holeman. “We have all worked tragic cases. Nothing like this. I can’t put anything close to this case.”<\/p>\n<p>Police continue to work 20 hours days, with sleepless nights, with one goal in mind. A team of hundreds of investigators continue to work the case, tracking down thousands of leads. Holeman admits it has been rough on everyone involved. Investigations can become a roller coaster ride with hopeful leads and dashed hopes when those leads are eliminated. When it gets tough, Holeman goes back to the saying, “Today is the day.”<\/p>\n<div id=\"attachment_1626\" style=\"width: 671px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1626\" class=\"wp-image-1626 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Sargent-300x225.jpg\" alt=\"Indiana State Police Sgt. Holeman interviewed by Alexis McAdams. Photo courtesy Alexis McAdams TV.\" width=\"661\" height=\"496\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 661px; --smush-placeholder-aspect-ratio: 661\/496;\" \/><p id=\"caption-attachment-1626\" class=\"wp-caption-text\"><em>Indiana State Police Sgt. Holeman interviewed by Alexis McAdams. Photo courtesy Alexis<\/em> McAdams TV.<\/p><\/div>\n<p>“I need to be here for Abby and Libby,” says Holeman, “Because I am going to find who did this and we are going to hold them responsible for their actions.”<\/p>\n<p>When Anna Williams was asked what justice will look like for her, “Justice will be that deep breath we get to take when my friend’s children are sleeping in their beds again. When people don’t worry about their children playing outside.” Williams continued, “Justice is in law enforcement. We believe in law enforcement. We believe in the FBI and everyone else that has worked on this case. That’s where justice will come from.”<\/p>\n<p>Unsolved homicide posters still hang in local company’s windows. The community stands united behind Libby and Abby’s families and law enforcement still working the case.<\/p>\n<div id=\"attachment_1627\" style=\"width: 498px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1627\" class=\"wp-image-1627 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Orange-Bulbs-300x169.jpg\" alt=\"Orange bulbs dot Delphi until the murderer of Abby and Libby is found. Source: Facebook Light Up for Abby and Libby.\" width=\"488\" height=\"275\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 488px; --smush-placeholder-aspect-ratio: 488\/275;\" \/><p id=\"caption-attachment-1627\" class=\"wp-caption-text\">Source: Facebook Light Up for Abby and Libby.<\/p><\/div>\n<p>Orange bulbs light up the entire town of Delphi. The community has committed to ensuring the golden glow lights the town until the killer of Abby and Libby is caught and brought to justice.<\/p>\n<p>If you have any information about the murders of Abby Williams and Libby German, please call 844-459-5786 or ABBYANDLIBBYTIP@CACOSHRF.COM.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By: Kym Pasqualini, Feature Crime Writer for Lauth Investigations On February 13, 2017, best friends Abigail “Abby” Williams, 13, and Liberty “Libby” German, 14, planned to go hiking near the beautiful area of Monon High Bridge Trail, east of their small town of Delphi, Indiana. At approximately 1:45 p.m. that afternoon, a family member dropped [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[35],"tags":[73,152,219,118,165,323,216,324,56,57,135,136,170,91,154,155,62,464,465,12,158,19,80,84,140,172],"class_list":["post-1617","post","type-post","status-publish","format-standard","hentry","category-private-investigations-news","tag-criminal-investigation","tag-fbi","tag-hire-private-investigator","tag-homicide","tag-homicide-investigation","tag-indiana-private-investigator","tag-indianapolis-private-investigation","tag-indianapolis-private-investigator","tag-investigations","tag-investigators","tag-kym-pasqualini","tag-lauth-investigations","tag-missing-child","tag-missing-loved-ones","tag-missing-person-expert","tag-missing-persons","tag-missing-persons-investigations","tag-murder","tag-murder-investigation","tag-private-investigation","tag-private-investigations","tag-private-investigator","tag-private-investigators","tag-professional-private-investigator","tag-thomas-lauth","tag-unsolved-homicide-investigation"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Snapchat murders missing girls from Delphi<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Snapchat murders missing girls from Delphi\" \/>\n<meta property=\"og:description\" content=\"By: Kym Pasqualini, Feature Crime Writer for Lauth Investigations On February 13, 2017, best friends Abigail “Abby” Williams, 13, and Liberty “Libby” German, 14, planned to go hiking near the beautiful area of Monon High Bridge Trail, east of their small town of Delphi, Indiana. At approximately 1:45 p.m. that afternoon, a family member dropped [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-23T10:57:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:38:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"Snapchat Murders: Not a Cold Case\",\"datePublished\":\"2018-02-23T10:57:50+00:00\",\"dateModified\":\"2021-04-09T17:38:58+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\"},\"wordCount\":2177,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\",\"keywords\":[\"criminal investigation\",\"FBI\",\"hire private investigator\",\"homicide\",\"homicide investigation\",\"Indiana private investigator\",\"indianapolis private investigation\",\"Indianapolis private investigator\",\"Investigations\",\"Investigators\",\"kym pasqualini\",\"lauth investigations\",\"missing child\",\"missing loved ones\",\"missing person expert\",\"missing persons\",\"missing persons investigations\",\"murder\",\"murder investigation\",\"Private investigation\",\"private investigations\",\"private investigator\",\"Private investigators\",\"professional private investigator\",\"thomas lauth\",\"unsolved homicide investigation\"],\"articleSection\":[\"Private Investigations News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\",\"url\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\",\"name\":\"Snapchat murders missing girls from Delphi\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\",\"datePublished\":\"2018-02-23T10:57:50+00:00\",\"dateModified\":\"2021-04-09T17:38:58+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage\",\"url\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\",\"contentUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Snapchat Murders: Not a Cold Case\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Snapchat murders missing girls from Delphi","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/","og_locale":"en_US","og_type":"article","og_title":"Snapchat murders missing girls from Delphi","og_description":"By: Kym Pasqualini, Feature Crime Writer for Lauth Investigations On February 13, 2017, best friends Abigail “Abby” Williams, 13, and Liberty “Libby” German, 14, planned to go hiking near the beautiful area of Monon High Bridge Trail, east of their small town of Delphi, Indiana. At approximately 1:45 p.m. that afternoon, a family member dropped [&hellip;]","og_url":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2018-02-23T10:57:50+00:00","article_modified_time":"2021-04-09T17:38:58+00:00","og_image":[{"url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg","type":"","width":"","height":""}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"Snapchat Murders: Not a Cold Case","datePublished":"2018-02-23T10:57:50+00:00","dateModified":"2021-04-09T17:38:58+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/"},"wordCount":2177,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg","keywords":["criminal investigation","FBI","hire private investigator","homicide","homicide investigation","Indiana private investigator","indianapolis private investigation","Indianapolis private investigator","Investigations","Investigators","kym pasqualini","lauth investigations","missing child","missing loved ones","missing person expert","missing persons","missing persons investigations","murder","murder investigation","Private investigation","private investigations","private investigator","Private investigators","professional private investigator","thomas lauth","unsolved homicide investigation"],"articleSection":["Private Investigations News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/","url":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/","name":"Snapchat murders missing girls from Delphi","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg","datePublished":"2018-02-23T10:57:50+00:00","dateModified":"2021-04-09T17:38:58+00:00","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#primaryimage","url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg","contentUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/02\/Abby-and-Libby-300x210.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/snapchat-murders-cold-case\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"Snapchat Murders: Not a Cold Case"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1617","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1617"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1617\/revisions"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}