{"id":1761,"date":"2018-05-15T18:34:30","date_gmt":"2018-05-15T18:34:30","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1761"},"modified":"2021-04-09T17:36:12","modified_gmt":"2021-04-09T17:36:12","slug":"background-checks-2","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/background-checks-2\/","title":{"rendered":"BACKGROUND CHECKS"},"content":{"rendered":"<p style=\"text-align: center;\"><b><\/b><b>Rooting Out Thieves in the Workplace <\/b><\/p>\n<div id=\"attachment_1762\" style=\"width: 694px\" class=\"wp-caption aligncenter\"><img fetchpriority=\"high\" fetchpriority=\"high\" decoding=\"async\" aria-describedby=\"caption-attachment-1762\" class=\" wp-image-1762\" src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\" alt=\"It is estimated 30% of employees steal from their employer.\" width=\"684\" height=\"456\" \/><p id=\"caption-attachment-1762\" class=\"wp-caption-text\"><em>It is estimated 30% of employees steal from their employer.<\/em><\/p><\/div>\n<p><span style=\"font-weight: 400;\">Most of us have dealt with a thief during our lifetime. Devious and sneaky, some thieves behave as if stealing is an art. It is usually a theft exposing them; however, many times, they can strike numerous times before getting caught. When theft happens in the workplace, it can not only be a costly lesson but the cause of a business failing.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">An estimated 30% of employees steal from their workplace affecting all types of businesses. For instance, if you are running a restaurant with $1 million sales annually, at only 4% theft within the company, your company would be losing $40,000 a year!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Employee theft costs U.S. businesses over $200 billion in annual losses. Not only are companies trying to prevent the public from stealing items, inventory, assets, and ideas from a business, they must also combat thieves on the inside. Unfortunately, 75% of employee-related crimes go undetected.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Theft can take many forms, such as: stealing money, embezzlement, unauthorized use of business or customer identity, and theft of intellectual property, such as cases of patent or trademark infringement. <\/span><\/p>\n<p style=\"text-align: center;\"><b>Combating Theft is Knowing How Employee Theft Occurs.<\/b><\/p>\n<p><b>Cash<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Employees who have access to a cash register is the most common way employees steal from companies. If unsecured, petty cash drawers or boxes, can be an easy target for thieves.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition, an employee can quote a higher price than the actual price of an item and keep the difference at the point of sale.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If employees have access to credit card information or checks, theft can happen as easily as sticking a few checks inside a folder, costing the owner thousands before it is detected.<\/span><\/p>\n<p><b>Checks and Fraud<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Most banks do not verify a signature on a company check making it very easy to sign and cash a check. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Credit card fraud is a number one threat to companies and consumers because most credit card holders admittedly do not check each line item on their credit card statement.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">According to the <\/span><a href=\"https:\/\/www.sba.gov\/blogs\/7-ways-protect-your-small-business-fraud-and-cybercrime\"><span style=\"font-weight: 400;\">U.S. Small Business Administration<\/span><\/a><span style=\"font-weight: 400;\"> (SBA), companies with less than 100 employees, lose approximately $155,000 as a result of fraud each year, a much higher rate than large companies. <\/span><\/p>\n<p><b>Payroll<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Employees may often perform actions and falsify records for work they didn’t do, such as requesting reimbursement for travel and other expenses unrelated to work. Employees may also set up fake payroll accounts for workers who have been terminated or retired. Creative thievery abounds.<\/span><\/p>\n<p><b>Time Sheets<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Time theft or “Buddy Punching” is a very popular way timesheets may easily be falsified. Individuals complete this theft by having one employee punch another employee in or out for the other. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Excessive breaks, malingering, surfing the Internet, chatting with employees or taking personal phone calls are other ways time theft occurs. While some of these things may not at first be thought of as stealing, all these actions, or inactions, can affect the bottom line and be taking advantage of an employer.<\/span><\/p>\n<p><b>Vendor Accounts<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Thieving employees will set up fake vendor accounts, submit phony invoices and issue checks for the false vendor. These checks can then be signed over to themselves and deposited. In addition, a variation would be paying a vendor $500 and writing a check to themselves, expensing the entire $500 to the vendor.<\/span><\/p>\n<p><b>Merchandise<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Loss of inventory can happen in the merchandise distribution process but can also happen before merchandise is made available to the public. Many times, employees will take items from a warehouse or newly arrived items before they are scanned into inventory software. Employees have even been known to steal entire shipping trucks containing merchandise headed to their employer’s company.<\/span><\/p>\n<p><b>Supplies<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Some employees steal smaller items such as typical office supplies, but furniture and equipment are not off limits for a thief.<\/span><\/p>\n<p><b>Information<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Many employees steal information to benefit themselves or a competitor. Types of information include: office memoranda, proprietary products, customer lists and\/or other confidential data. Theft can occur by email, printing, or copying information to a flash drive or cell phone, or simply carrying it out in a purse or folder. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sometimes, theft can be subtler, such as luring customers away, purposefully providing poor service, even spreading rumors to damage a company’s reputation and cause a down-turn in business.  All are considered losses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While there are ways to combat theft within your company, ultimately identifying the thief before they are hired is the most effective way to reduce the occurence of theft. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The SBA recommends:  “<\/span><i><span style=\"font-weight: 400;\">One of the first steps to preventing fraudulent employee behavior is to make the right hiring decision.”<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Background checks are a good practice for any employer, large or small, especially for those employees who will be handling cash, high-value merchandise, or have access to sensitive customer or financial data. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For over twenty-years, Thomas Lauth of <\/span><a href=\"https:\/\/lauthinveststg.wpengine.com\"><span style=\"font-weight: 400;\">Lauth Investigations International<\/span><\/a><span style=\"font-weight: 400;\"> has been working nationwide and helping educate employers on methods used to combat theft. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“The first and most effective way to address theft in the workplace, is to conduct an extensive background check,” says Lauth. “A background check can provide insight into an individual’s behavior, character, and integrity.”<\/span><\/p>\n<p style=\"text-align: center;\"><b>Which Types of Background Checks Should You Conduct?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">According to the <\/span><a href=\"https:\/\/www.uschamber.com\/\"><span style=\"font-weight: 400;\">U.S. Chamber of Commerce<\/span><\/a><span style=\"font-weight: 400;\">, upwards to 30% of business failures are caused by employee theft. Thus, conducting effective, extensive background checks helps to mitigate your risk of hiring objectionable or even dangerous employees.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Not all background checks are the same. As you build a profile of your future employee, there are several kinds of background checks you should consider. For example, a criminal background check is different than checking on an individual’s credit score or military service, these require consent. A criminal background check does not require consent; however, some states have laws restricting how you use the information collected during a criminal background check.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Private investigation firms like Lauth Investigations offer complete background checks while helping you comply with the law.<\/span><\/p>\n<p style=\"text-align: center;\"><b>Protecting Your Legal Liability with Background Checks<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Smaller businesses often forego background checks for two reasons: 1. A false sense of trust and security developed by business owners working too closely with employees. 2. Most businesses do not understand the legal liabilities associated with the failure to conduct employee screening and background checks.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Any business where employees provide a direct service and interact with customers, such as contractors or daycare providers, is liable if an employee does harm to a customer and the employee has a history of wrongdoing.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A company, big and small. may not recover from this kind of lawsuit.<\/span><\/p>\n<p style=\"text-align: center;\"><b>Choosing the Right Company to Conduct Background Checks<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Protecting the interests of your workplace and customers while reducing potential liability is of utmost importance; therefore, it is vital to select a company you can trust to conduct the background screening both efficiently and thoroughly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While employers can do some background checking of their own, working with an experienced and reputable company can ensure the reliability and thoroughness of the background screening.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Purchasing instant public records found online is not appropriate for conducting potential employee background checks. Most certainly if your hiring decision is based on tpublic record data, your company could land in hot water.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Most public databases do not fact check, clean up or refresh their data providing completely different information than received from an investigative firm experienced in conducting professional, legal and full background screening.<\/span><\/p>\n<div id=\"attachment_1763\" style=\"width: 807px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1763\" class=\"wp-image-1763 lazyload\" data-src=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/handcuff-300x158.jpg\" alt=\"Private investigators have access to databases that can definitively determine if a potential employee has a criminal background.\" width=\"797\" height=\"420\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 797px; --smush-placeholder-aspect-ratio: 797\/420;\" \/><p id=\"caption-attachment-1763\" class=\"wp-caption-text\"><em>Private investigators have access to databases to determine if a potential employee has a criminal background.<\/em><\/p><\/div>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">A reputable company providing background screening services will ensure the information you receive is current and accurate.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a hiring decision is made based upon information found in the background check, in most cases, the company must inform the potential employee of the source used to obtain the information for the background checks (which is where using public databases can get your company in legal trouble).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">What can you expect from a professional background check? According to Lauth, it’s all in the details and you pay for what you get. If you want detailed, accurate information, you will choose a Private Investigation Background Search.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unlike a personal background search using public databases, private investigators have access to several databases providing a variety of information.<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Employment history: This search will bring up employment records to include all positions held, making it easier to find discrepancies in a resume. It will also include salaries associated with the positions.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Academic and professional affiliations: Qualifications to include academic history and certification, even if the person did not complete the program.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Criminal records: Including a detailed outline of all criminal activity from traffic warnings and tickets to arrests and convictions. Also, these include jail time served and fines paid.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Financial Standing: Reflects all liens, judgments, bank accounts, current and previous property ownership, repossession of vehicles or other personal property, NSF checks and bankruptcies.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">In addition to the typical information received through a personal background check, a private investigator will include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Worker compensation claims an individual has filed. This can help determine the character of an individual by looking at the number of claims they have filed which could reveal a person is dishonest and fraudulent.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ascertain causes of accidents or any criminal activity. DMV reports will show accident dates and basic information but do not reflect the cause. Private investigators can provide the cause behind the accident and whether criminal activity was involved.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Information on business and personal partners.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Analysis of all findings.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Relying on an Internet search is risky. A professional background screening will be more in depth than simply entering a name in a database. When a company’s future is at stake, the only way to go to obtain concise information needed to make informed decisions is a professional, private investigations extensive background check.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rooting Out Thieves in the Workplace  Most of us have dealt with a thief during our lifetime. Devious and sneaky, some thieves behave as if stealing is an art. It is usually a theft exposing them; however, many times, they can strike numerous times before getting caught. When theft happens in the workplace, it can [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[268,518,35,50],"tags":[100,144,276,73,16,21,147,219,281,329,323,216,56,57,135,136,52,49,59,12,158,80,84,140,285],"class_list":["post-1761","post","type-post","status-publish","format-standard","hentry","category-corporate-investigations","category-criminal-investigation","category-private-investigations-news","category-tips-facts","tag-background-checks","tag-corporate-investigation","tag-corporate-investigations-2","tag-criminal-investigation","tag-employee-theft","tag-fraud","tag-fraud-investigation","tag-hire-private-investigator","tag-hr","tag-human-resources","tag-indiana-private-investigator","tag-indianapolis-private-investigation","tag-investigations","tag-investigators","tag-kym-pasqualini","tag-lauth-investigations","tag-prevent-internal-theft","tag-prevention","tag-private-eyes","tag-private-investigation","tag-private-investigations","tag-private-investigators","tag-professional-private-investigator","tag-thomas-lauth","tag-workplace-investigation"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why background checks are important<\/title>\n<meta name=\"description\" content=\"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/background-checks-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why background checks are important\" \/>\n<meta property=\"og:description\" content=\"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/background-checks-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2018-05-15T18:34:30+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:36:12+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"BACKGROUND CHECKS\",\"datePublished\":\"2018-05-15T18:34:30+00:00\",\"dateModified\":\"2021-04-09T17:36:12+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/\"},\"wordCount\":1646,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\",\"keywords\":[\"background checks\",\"corporate investigation\",\"corporate investigations\",\"criminal investigation\",\"employee theft\",\"fraud\",\"fraud investigation\",\"hire private investigator\",\"HR\",\"human resources\",\"Indiana private investigator\",\"indianapolis private investigation\",\"Investigations\",\"Investigators\",\"kym pasqualini\",\"lauth investigations\",\"Prevent Internal Theft\",\"Prevention\",\"Private eyes\",\"Private investigation\",\"private investigations\",\"Private investigators\",\"professional private investigator\",\"thomas lauth\",\"workplace investigation\"],\"articleSection\":[\"Corporate Investigations\",\"Criminal Investigation\",\"Private Investigations News\",\"Tips &amp; Facts\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/background-checks-2\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/\",\"url\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/\",\"name\":\"Why background checks are important\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\",\"datePublished\":\"2018-05-15T18:34:30+00:00\",\"dateModified\":\"2021-04-09T17:36:12+00:00\",\"description\":\"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/background-checks-2\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage\",\"url\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\",\"contentUrl\":\"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/background-checks-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"BACKGROUND CHECKS\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why background checks are important","description":"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/background-checks-2\/","og_locale":"en_US","og_type":"article","og_title":"Why background checks are important","og_description":"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.","og_url":"https:\/\/lauthinvestigations.com\/background-checks-2\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2018-05-15T18:34:30+00:00","article_modified_time":"2021-04-09T17:36:12+00:00","og_image":[{"url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg","type":"","width":"","height":""}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"BACKGROUND CHECKS","datePublished":"2018-05-15T18:34:30+00:00","dateModified":"2021-04-09T17:36:12+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/"},"wordCount":1646,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg","keywords":["background checks","corporate investigation","corporate investigations","criminal investigation","employee theft","fraud","fraud investigation","hire private investigator","HR","human resources","Indiana private investigator","indianapolis private investigation","Investigations","Investigators","kym pasqualini","lauth investigations","Prevent Internal Theft","Prevention","Private eyes","Private investigation","private investigations","Private investigators","professional private investigator","thomas lauth","workplace investigation"],"articleSection":["Corporate Investigations","Criminal Investigation","Private Investigations News","Tips &amp; Facts"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/background-checks-2\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/","url":"https:\/\/lauthinvestigations.com\/background-checks-2\/","name":"Why background checks are important","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage"},"thumbnailUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg","datePublished":"2018-05-15T18:34:30+00:00","dateModified":"2021-04-09T17:36:12+00:00","description":"Performing background checks on your employees might be one of the most crucial parts of your hiring process, but some companies refuse to do them.","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/background-checks-2\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#primaryimage","url":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg","contentUrl":"https:\/\/lauthinveststg.wpengine.com\/wp-content\/uploads\/2018\/05\/THIEF-300x200.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/background-checks-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"BACKGROUND CHECKS"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1761","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1761"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1761\/revisions"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1761"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1761"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1761"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}