{"id":1833,"date":"2018-08-28T17:03:53","date_gmt":"2018-08-28T17:03:53","guid":{"rendered":"https:\/\/lauthinveststg.wpengine.com\/blog\/?p=1833"},"modified":"2021-04-09T17:34:30","modified_gmt":"2021-04-09T17:34:30","slug":"media-missing-white-woman-syndrome","status":"publish","type":"post","link":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/","title":{"rendered":"The Media and Missing White Woman Syndrome"},"content":{"rendered":"<p><strong>If you are a missing person, it helps to be white<\/strong><\/p>\n<div id=\"attachment_1289\" style=\"width: 785px\" class=\"wp-caption aligncenter\"><img fetchpriority=\"high\" fetchpriority=\"high\" decoding=\"async\" aria-describedby=\"caption-attachment-1289\" class=\"wp-image-1289\" src=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\" alt=\"\" width=\"775\" height=\"433\" \/><p id=\"caption-attachment-1289\" class=\"wp-caption-text\">(Jasmine Moody vanished in Detroit, Michigan on December 4, 2014.)<\/p><\/div>\n<p>Jasmine Moody, a 22-year old Texas Women’s University student mysteriously vanished on December 4, 2014, while visiting a friend in Detroit, Michigan. Nearly four years later, police are no closer to figuring out what happened to her. News coverage of her disappearance has long since vanished from the scene too.<\/p>\n<p>Approximately 7:30 p.m., the evening of December 4th, Jasmine was last seen leaving her friend’s home in the vicinity of the 3700 block of Baldwin, in the Van Dyke and Mack area of Detroit. Her family, who lives in Texas, is convinced foul play is involved in Jasmine’s disappearance and disappointed in the police department’s response and ensuing investigation.<\/p>\n<p>“My daughter was real popular. She had a lot of friends. She was very social and energetic,” Jasmine’s mother Lisa Kidd told Dateline. “She always had a smile on her face. Always, always.”<\/p>\n<p>Jasmine had known she wanted to be a nurse since she was 16 and described as a well-rounded student at Texas Woman’s University. According to her stepfather Patrick Kidd, Jasmine was a straight-A student, danced, and was training to be part of the U.S. Armed Forces through her school’s ROTC program.<\/p>\n<p>According to police, Jasmine had developed an online relationship with Brittany Gurley, a woman who lived in Detroit. Just a few months after meeting online, Jasmine and Brittany had developed a strong friendship and Jasmine flew to visit Brittany and her family for Thanksgiving.<\/p>\n<p>On the evening of December 4th, the two women allegedly got into an argument about Jasmine’s social media posts. Brittany and her family would later tell police that Jasmine put on a hoodie and walked out of the house.<\/p>\n<p>Little else is known about her disappearance. No major ground search was conducted, and ongoing media exposure on a national level has been minimal.<\/p>\n<p><img decoding=\"async\" class=\"size-full wp-image-1288 alignleft lazyload\" data-src=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/spierer1.png\" alt=\"\" width=\"394\" height=\"535\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 394px; --smush-placeholder-aspect-ratio: 394\/535;\" \/>In contrast to Jasmine Moody’s case, Lauren Spierer, a 20-year old student at Indiana University, vanished June 3, 2011, after an evening out with friends in Bloomington, Indiana. Lauren, who grew up in Scarsdale, an affluent town in Westchester, New York. Her disappearance quickly garnered national press attention but remains unsolved.<\/p>\n<p>“Lauren’s disappearance has been and continues to be the most heart-wrenching experience of our lives,” Lauren’s family posted on Facebook on June 4, 2018, seven years after her disappearance. “I remember writing a few short months after Lauren’s disappearance that I never thought I would see an October without answers. I could never have imagined we would still be searching for Lauren seven years later. I end this now as I start each morning, hoping today will be the day.”<\/p>\n<p>After an evening out at Kilroy’s Sports Bar with friends, Lauren was last seen on 11th Street and College Avenue in Bloomington at approximately 4:15 a.m. She had left her cell phone and shoes at the bar, presumedly taking her shoes off in the beach-themed bar’s sand-filled courtyard.<\/p>\n<p>National news quickly began covering Lauren’s disappearance while hundreds of volunteers assembled to distribute thousands of fliers and help conduct ground searches of the area. A billboard overlooking the Indiana State Fairgrounds, along Fall Creek Parkway, asks the public for any information that would lead to the whereabouts of Lauren.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<div id=\"attachment_1287\" style=\"width: 596px\" class=\"wp-caption aligncenter\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1287\" class=\"wp-image-1287 lazyload\" data-src=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/spierer2.png\" alt=\"\" width=\"586\" height=\"439\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 586px; --smush-placeholder-aspect-ratio: 586\/439;\" \/><p id=\"caption-attachment-1287\" class=\"wp-caption-text\">(Thousands of flyers of missing person Lauren Spierer have been distributed throughout the country.)<\/p><\/div>\n<p>Hundreds of volunteers continued to turn out daily to help the family in their search.<\/p>\n<p>Lauren’s case was profiled on popular America’s Most Wanted in 2011, leading to dozens of leads but not that one the family needed. Over the years, dozens of news media outlets have covered Lauren’s story.<\/p>\n<p>Early on, Lauren’s parents hired private investigators and today, maintain an active Facebook group.<\/p>\n<p>In one very revealing and heartfelt post, Lauren’s mother writes, “I could not have imagined on June 3, 2011, that my life would ever have any semblance of normalcy. Unfortunately, that word will never be applied to our lives. You learn to live with routines which get you through your days, weeks, months, and years. We will never know normal. Some of the things taken for granted in ordinary families are so far removed from ours it’s difficult to fathom. They range from everyday life events, a wedding, a birth and yes sadly death. What I wouldn’t do to hear Lauren’s voice or even just to notice a text on my phone. Something so simple as a text. My heart breaks at the thought of it. Well, those responsible will never be able to imagine. I have said it before and I know it’s redundant but what could have been an accident in a few short hours became a crime. The worst nightmare any parent or sister could imagine.”<\/p>\n<p>Every day Lauren’s family simply hopes for answers. That’s all any family of a missing person could ask for.<\/p>\n<p>Two young women, one black, one white, both ambitious students couldn’t be treated more differently by the media. One becomes nearly a household name, the other nearly forgotten. With absolute certainty, no one can say exactly why.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>What are the numbers?<\/strong><\/p>\n<p>As of May 31, 2018, there were 87,608 active missing person cases in the National Crime Information Center (NCIC) database at the Federal Bureau of Investigation. Of the active missing person cases listed in NCIC, 40,108 cases are of missing women and 26,842 are black.<\/p>\n<div id=\"attachment_1286\" style=\"width: 1221px\" class=\"wp-caption alignnone\"><img decoding=\"async\" aria-describedby=\"caption-attachment-1286\" class=\"size-full wp-image-1286 lazyload\" data-src=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/tablespierer.png\" alt=\"\" width=\"1211\" height=\"799\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 1211px; --smush-placeholder-aspect-ratio: 1211\/799;\" \/><p id=\"caption-attachment-1286\" class=\"wp-caption-text\">(National Crime Information Center Report)<\/p><\/div>\n<p>Names like Chandra Levy, Laci Peterson, Elizabeth Smart, Polly Klaas, Natalee Holloway and Lauren Spierer have become familiar household names. Their missing person cases have dominated the headlines over the years. Cases like Jasmine Moody’s are not rare and unfortunately rarely make the local news.<\/p>\n<p>Historically, whenever a female missing person becomes a national headline, she is almost certain to be a pretty, young white woman.<\/p>\n<p>When was the last time you heard of a missing black female on CNN or other national news outlets?<\/p>\n<p>In an NBC news story “<a href=\"http:\/\/www.nbcnews.com\/id\/5325808\/ns\/us_news-crime_and_courts\/t\/damsels-distress\/#.W1VGYfZFwdU\">Damsels in Distress<\/a>” Roy Peter Clark, head of Poynter Institute for Media Studies is quoted, “It’s all about sex,” said Clark. “Young white women give editors and television producers what they want.”<\/p>\n<p>“There are several common threads,” said Clark. “The victims that get the most coverage are female rather than male. They are white, in general, rather than young people of color. They are at least middle class, if not upper middle class.”<\/p>\n<p>Some say the cases fit a narrative pattern that storytellers have used for more than a century, a pattern who design still incorporates remnants of an outmoded view of women and black people and their roles in society.<\/p>\n<p>When it comes to popular stories, Clark said, “there is this perverted, racist view of the world. White is good; black is bad. Blonde is good; dark is bad. Young is good; old is bad. And I think we can find versions of this story going back to the tabloid wars of more than a hundred years ago.”<\/p>\n<p>Regardless of class, color or age, it is clear that there is disproportionate coverage of black missing person cases. Referred to as “Missing White Woman Syndrome” and has led to a number of tough on crime measures named after white women who disappeared such as Suzanne’s Law, Kristen’s Law, Jennifer’s Law, Amber Alert and others.<\/p>\n<p>In a study conducted by Baylor University, “<a href=\"https:\/\/www.academia.edu\/944503\/The_Invisible_Damsel_Differences_in_How_National_Media_Outlets_Framed_the_Coverage_of_Missing_Black_and_White_Women_in_the_Mid-2000s\">The Invisible Damsel: Differences in How National Media Outlets Framed the Coverage of Missing Black and White Women in the Mid-2000s<\/a>,” Professors Moody, Dorris and Blackwell concluded that in addition to race and class, factors such as supposed attractiveness, body size, and youthfulness function as unfair criteria in determining newsworthiness in the national news coverage of missing women. In addition, news coverage of missing black women was more likely to focus on the victim’s problems, such as abusive relationships, a troubled past, while coverage of white women tends to focus on roles as mothers or daughters.<\/p>\n<p>Zach Somers, a sociologist at Northwestern University, noted that while there has been extensive research that shows that white people are more likely than people of color to appear in news coverage as victims of violent crime, there is relatively none when it comes to missing person cases.<\/p>\n<p>Victim blaming appears to be compounding the unequal coverage and reinforces the view that black female victims are not only less innocent, but less worthy of rescue relative to white women. Thus, the term “Damsels in Distress.”<\/p>\n<p>Others have blamed “police brutality” for the lack of publicity given to black female missing persons, attributing the silence to a habit of “sexism and patriarchy” in American society.<\/p>\n<p><img decoding=\"async\" class=\"size-full wp-image-1290 aligncenter lazyload\" data-src=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/blackandmissing.png\" alt=\"\" width=\"1137\" height=\"260\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" style=\"--smush-placeholder-width: 1137px; --smush-placeholder-aspect-ratio: 1137\/260;\" \/><\/p>\n<p>One group is fighting the imbalance of national media exposure that exists. The <a href=\"http:\/\/blackandmissing.org\/\">Black and Missing Foundation’s<\/a> mission is to draw more attention to missing African Americans by providing an outlet for spreading the word through technology and print – and their work is making a difference.<\/p>\n<p>By creating relationships with the media, government agencies, and the public, they are increasing the chances of missing black women being covered in the news and ultimately, to bring them home.<\/p>\n<p>Derica and Natalie Wilson, two sisters-in-law, and founders of the Black and Missing Foundation have been profiled in People Magazine, Essence, Ebony, Huffington Post, Washington Post and developed a partnership with TV One. This year they celebrate ten years, helping thousands of families of missing persons and finding nearly 300 people.<\/p>\n<p>“Many times, we are a family’s last resort – their last hope., says co-founder Natalie Wilson. This platform allows us to open our doors for families searching for their missing loved ones and not restrict access to help.”<\/p>\n<p>Black and Missing Foundation have set the example for other groups to follow, especially the media.<\/p>\n<p>Thomas Lauth of <a href=\"http:\/\/www.lauthmissingpersons.com\/\">Lauth Missing Persons: an Expert in Missing Children and Adults<\/a> noted, &#8220;In the 17 years of conducting missing persons cases for families and non-profit organizations, there is certainly a media and public bias against a missing person of color. When the general public and the media see a blonde 18 year-old on CNN that is missing&#8211;as opposed to an African American female on CNN&#8211;there is immediate attention to the blonde. Luckily there are non profit organizations such as Black and Missing to help bring more exposure to advocacy to the families for persons of color.&#8221;<\/p>\n<p>Finding missing persons is a cooperative effort between the police, media, social service agencies and especially the public. With every news story, the coverage generates leads and increases the chance of that one lead being reported that will assist law enforcement in the investigation, and even close a case.<\/p>\n<p>When it comes to missing persons there is no black and white, there are only families who are missing their daughters, siblings missing their sisters, children who are missing their mothers. There is no rich or poor, only families, human beings experiencing the most traumatic experience of their lifetimes.<\/p>\n<p>People . . . who need our help.<\/p>\n<p><em>For more of Kym Pasqualini&#8217;s work in missing persons, please visit her website, <a href=\"https:\/\/www.missingleads.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Missing Leads<\/a> , or log on to Facebook and join the conversation on the <a href=\"https:\/\/www.facebook.com\/groups\/missingleads\/?ref=bookmarks\" target=\"_blank\" rel=\"noopener noreferrer\">Missing Leads Discusssion page<\/a>!<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are a missing person, it helps to be white Jasmine Moody, a 22-year old Texas Women’s University student mysteriously vanished on December 4, 2014, while visiting a friend in Detroit, Michigan. Nearly four years later, police are no closer to figuring out what happened to her. News coverage of her disappearance has long [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[347,529,660,50],"tags":[638,477,639,640,641,642,643,644,152,645,646,647,648,649,650,651,136,526,652,265,653,654,655,656,657,658,659,156,43,661,19,662,663,664,140],"class_list":["post-1833","post","type-post","status-publish","format-standard","hentry","category-investigations","category-missing-person","category-news-and-media","category-tips-facts","tag-americas-most-wanted","tag-black-and-missing","tag-bloomington","tag-chandra-levy","tag-cnn","tag-detroit-michigan","tag-elizabeth-smart","tag-facebook-group","tag-fbi","tag-federal-bureau-of-investigation","tag-ground-search","tag-indiana-university","tag-jasmine-moody","tag-kilroy","tag-laci-peterson","tag-lauren-spierer","tag-lauth-investigations","tag-law-enforcement","tag-media","tag-missing-person","tag-missing-persons-organization","tag-missing-poc","tag-missing-white-woman-syndrome","tag-missing-woman","tag-natalee-holloway","tag-national-crime-information-center","tag-nbc","tag-ncic","tag-police","tag-polly-klaas","tag-private-investigator","tag-rotc","tag-social-service-agencies","tag-the-invesible-damsel","tag-thomas-lauth"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Missing White Woman Syndrome News Media<\/title>\n<meta name=\"description\" content=\"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Missing White Woman Syndrome News Media\" \/>\n<meta property=\"og:description\" content=\"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\" \/>\n<meta property=\"og:site_name\" content=\"Indiana Private Investigators | Lauth Investigations International, Inc.\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\" \/>\n<meta property=\"article:published_time\" content=\"2018-08-28T17:03:53+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-09T17:34:30+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\" \/>\n<meta name=\"author\" content=\"admin_lauth\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:site\" content=\"@Lauthinv\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin_lauth\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\"},\"author\":{\"name\":\"admin_lauth\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\"},\"headline\":\"The Media and Missing White Woman Syndrome\",\"datePublished\":\"2018-08-28T17:03:53+00:00\",\"dateModified\":\"2021-04-09T17:34:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\"},\"wordCount\":1898,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage\"},\"thumbnailUrl\":\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\",\"keywords\":[\"America's Most Wanted\",\"black and missing\",\"Bloomington\",\"Chandra Levy\",\"CNN\",\"Detroit michigan\",\"Elizabeth Smart\",\"Facebook group\",\"FBI\",\"Federal Bureau of Investigation\",\"ground search\",\"Indiana University\",\"Jasmine Moody\",\"Kilroy\",\"Laci Peterson\",\"Lauren Spierer\",\"lauth investigations\",\"law enforcement\",\"media\",\"missing person\",\"Missing persons organization\",\"missing POC\",\"missing white woman syndrome\",\"missing woman\",\"Natalee Holloway\",\"National Crime Information Center\",\"NBC\",\"NCIC\",\"police\",\"Polly Klaas\",\"private investigator\",\"ROTC\",\"social service agencies\",\"The Invesible Damsel\",\"thomas lauth\"],\"articleSection\":[\"Investigations\",\"Missing Person\",\"News and Media\",\"Tips &amp; Facts\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\",\"url\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\",\"name\":\"Missing White Woman Syndrome News Media\",\"isPartOf\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage\"},\"thumbnailUrl\":\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\",\"datePublished\":\"2018-08-28T17:03:53+00:00\",\"dateModified\":\"2021-04-09T17:34:30+00:00\",\"description\":\"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.\",\"breadcrumb\":{\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage\",\"url\":\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\",\"contentUrl\":\"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lauthinvestigations.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Media and Missing White Woman Syndrome\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lauthinvestigations.com\/#website\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"name\":\"Lauth Investigations\",\"description\":\"Indianapolis Private Investigators - Private Detectives\",\"publisher\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lauthinvestigations.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/lauthinvestigations.com\/#organization\",\"name\":\"Lauth Investigations International, Inc.\",\"url\":\"https:\/\/lauthinvestigations.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"contentUrl\":\"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg\",\"width\":300,\"height\":73,\"caption\":\"Lauth Investigations International, Inc.\"},\"image\":{\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810\",\"https:\/\/x.com\/Lauthinv\",\"https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/\",\"https:\/\/pinterest.com\/lauthinv\/\",\"https:\/\/youtu.be\/jrcjzCP5OA0\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47\",\"name\":\"admin_lauth\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g\",\"caption\":\"admin_lauth\"},\"url\":\"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Missing White Woman Syndrome News Media","description":"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/","og_locale":"en_US","og_type":"article","og_title":"Missing White Woman Syndrome News Media","og_description":"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.","og_url":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/","og_site_name":"Indiana Private Investigators | Lauth Investigations International, Inc.","article_publisher":"https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","article_published_time":"2018-08-28T17:03:53+00:00","article_modified_time":"2021-04-09T17:34:30+00:00","og_image":[{"url":"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png","type":"","width":"","height":""}],"author":"admin_lauth","twitter_card":"summary_large_image","twitter_creator":"@Lauthinv","twitter_site":"@Lauthinv","twitter_misc":{"Written by":"admin_lauth","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#article","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/"},"author":{"name":"admin_lauth","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47"},"headline":"The Media and Missing White Woman Syndrome","datePublished":"2018-08-28T17:03:53+00:00","dateModified":"2021-04-09T17:34:30+00:00","mainEntityOfPage":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/"},"wordCount":1898,"commentCount":0,"publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"image":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage"},"thumbnailUrl":"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png","keywords":["America's Most Wanted","black and missing","Bloomington","Chandra Levy","CNN","Detroit michigan","Elizabeth Smart","Facebook group","FBI","Federal Bureau of Investigation","ground search","Indiana University","Jasmine Moody","Kilroy","Laci Peterson","Lauren Spierer","lauth investigations","law enforcement","media","missing person","Missing persons organization","missing POC","missing white woman syndrome","missing woman","Natalee Holloway","National Crime Information Center","NBC","NCIC","police","Polly Klaas","private investigator","ROTC","social service agencies","The Invesible Damsel","thomas lauth"],"articleSection":["Investigations","Missing Person","News and Media","Tips &amp; Facts"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/","url":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/","name":"Missing White Woman Syndrome News Media","isPartOf":{"@id":"https:\/\/lauthinvestigations.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage"},"image":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage"},"thumbnailUrl":"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png","datePublished":"2018-08-28T17:03:53+00:00","dateModified":"2021-04-09T17:34:30+00:00","description":"Missing White Woman Syndrome has plagued coverage of missing persons cases for decades as POC continue to receive inconsistent coverage of their cases, if at all.","breadcrumb":{"@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#primaryimage","url":"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png","contentUrl":"http:\/\/www.lauthmissingpersons.com\/wp-content\/uploads\/2018\/07\/jasminepic1.png"},{"@type":"BreadcrumbList","@id":"https:\/\/lauthinvestigations.com\/media-missing-white-woman-syndrome\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lauthinvestigations.com\/"},{"@type":"ListItem","position":2,"name":"The Media and Missing White Woman Syndrome"}]},{"@type":"WebSite","@id":"https:\/\/lauthinvestigations.com\/#website","url":"https:\/\/lauthinvestigations.com\/","name":"Lauth Investigations","description":"Indianapolis Private Investigators - Private Detectives","publisher":{"@id":"https:\/\/lauthinvestigations.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lauthinvestigations.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/lauthinvestigations.com\/#organization","name":"Lauth Investigations International, Inc.","url":"https:\/\/lauthinvestigations.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/","url":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","contentUrl":"https:\/\/lauthinvestigations.com\/wp-content\/uploads\/2016\/06\/lauth-logo.jpg","width":300,"height":73,"caption":"Lauth Investigations International, Inc."},"image":{"@id":"https:\/\/lauthinvestigations.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Lauth-Investigations-International\/416463471763810","https:\/\/x.com\/Lauthinv","https:\/\/www.linkedin.com\/company\/lauth-investigations-international\/","https:\/\/pinterest.com\/lauthinv\/","https:\/\/youtu.be\/jrcjzCP5OA0"]},{"@type":"Person","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/4391f2ef99e33749fd6d9c516e241d47","name":"admin_lauth","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/lauthinvestigations.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a3828784c8c5c40adfae4c8277a1c8d87bb51793ebb879b120e576ebf6176c9a?s=96&d=mm&r=g","caption":"admin_lauth"},"url":"https:\/\/lauthinvestigations.com\/author\/admin_lauth\/"}]}},"_links":{"self":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1833","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/comments?post=1833"}],"version-history":[{"count":0,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/posts\/1833\/revisions"}],"wp:attachment":[{"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/media?parent=1833"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/categories?post=1833"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lauthinvestigations.com\/wp-json\/wp\/v2\/tags?post=1833"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}